----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  Han Zhao
       log:  E:\data_science_reproducibility\data_science.log
  log type:  text
 opened on:  13 Dec 2023, 18:09:10

. 
. 
. /**********/
. /*ANALYSES*/
. /**********/
. 
. /**************************************************************************/
. /*TABLES 1 AND 2 Ö IMPACTS ON STUDENT ACHIEVEMENT (AT MIDLINE AND ENDLINE)*/
. /**************************************************************************/
. 
. /*compare GUOPEI (treatment == 2) with GUOPEI + FOLLOW-UP (treatment == 1) with CONTROL */
. foreach var of varlist $mainoutcomes {
  2.         regress `var' i.treatment z_baseline i.blockZ if spillover == 0, vce(cluster schid)
  3.         lincom 1.treatment - 2.treatment
  4.         local tstat= r(estimate)/r(se)
  5.     local pval = tprob(r(df), abs(`tstat'))
  6.     outreg2 using "3ie_guopei_control_stu_zscore.xls", adds(GUOPEI + FOLLOW-UP vs. guopei, r(estimate), p-val,`pval') dec(3) excel append               
  7.         
.         regress `var' i.treatment $covariates i.blockZ if spillover == 0, vce(cluster schid)
  8.         lincom 1.treatment - 2.treatment
  9.         local tstat=r(estimate)/r(se)
 10.     local pval = tprob(r(df), abs(`tstat'))
 11.     outreg2 using "3ie_guopei_control_stu_zscore.xls", adds(GUOPEI + FOLLOW-UP vs. guopei, r(estimate), p-val,`pval') dec(3) excel append               
 12. }

Linear regression                                      Number of obs =   15987
                                                       F(  8,   298) = 1043.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5537
                                                       Root MSE      =  .66403

                                (Std. Err. adjusted for 299 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0000904   .0306048     0.00   0.998    -.0601386    .0603194
          2  |  -.0149546   .0280099    -0.53   0.594    -.0700769    .0401676
             |
  z_baseline |    .749061    .008246    90.84   0.000     .7328332    .7652888
             |
      blockZ |
         18  |  -.0724939   .0358437    -2.02   0.044    -.1430326   -.0019551
         19  |  -.0673749   .0469041    -1.44   0.152    -.1596802    .0249304
         27  |  -.0963447   .0381158    -2.53   0.012    -.1713551   -.0213344
         28  |   -.048558   .0353951    -1.37   0.171    -.1182141     .021098
         29  |  -.0404684   .0464921    -0.87   0.385    -.1319628    .0510259
             |
       _cons |   .0469113   .0299044     1.57   0.118    -.0119392    .1057618
------------------------------------------------------------------------------

 ( 1)  1.treatment - 2.treatment = 0

------------------------------------------------------------------------------
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .015045   .0293543     0.51   0.609     -.042723     .072813
------------------------------------------------------------------------------
unrecognized command:  outreg2
r(199);

end of do-file

r(199);

. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. cd "E:/data_science_reproducibility/" 
E:\data_science_reproducibility

. 
. global mainoutcomes z_midline z_endline

. global covariates z_baseline age female father_jhs mother_jhs ses1 class_size t_female t_age t_exp t_4yrcoll t_cert t_major_math t_rank

. global t_covariates t_female t_age2 t_4yrcoll t_rank t_cert t_exp t_major_math

. global sec_outcomes_stu_end e_dropout e_self_concept e_anxiety e_intr_motiv e_instrument_motiv e_time_math 

. global sec_outcomes_tea_end t_practice_end t_care_end t_mgmt_end t_comm_end

. global sec_outcomes_tea2_end z_t_math_end t_intr_mot_end t_prosoc_mot_end e_t_math_t_direct e_t_math_t_active e_t_math_fixed e_t_math_rules e_t_math_inquiry    

. 
. use "E:/data_science_reproducibility/NTTP---except-Table-5.dta", replace

. log using data_science.log, replace
log file already open
r(604);

end of do-file

r(604);

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

.         regress `var' i.treatment $covariates i.blockZ if spillover == 0, vce(cluster schid)
depvar may not be a factor variable
r(198);

end of do-file

r(198);

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

.         regress `var' i.treatment $covariates i.blockZ if spillover == 0, vce(cluster schid)
depvar may not be a factor variable
r(198);

end of do-file

r(198);

. foreach var of varlist $mainoutcomes {
  2. 
. regress `var' i.treatment z_baseline i.blockZ if spillover == 0, vce(cluster schid)
  3. 
. lincom 1.treatment - 2.treatment
  4. 
. local tstat= r(estimate)/r(se)
  5. 
.     local pval = tprob(r(df), abs(`tstat'))
  6. 
.     outreg2 using "3ie_guopei_control_stu_zscore.xls", adds(GUOPEI + FOLLOW-UP vs. guopei, r(estimate), p-val,`pval') dec(3) excel append
  7. 
. 
. 
. regress `var' i.treatment $covariates i.blockZ if spillover == 0, vce(cluster schid)
  8. 
. lincom 1.treatment - 2.treatment
  9. 
. local tstat=r(estimate)/r(se)
 10. 
.     local pval = tprob(r(df), abs(`tstat'))
 11. 
.     outreg2 using "3ie_guopei_control_stu_zscore.xls", adds(GUOPEI + FOLLOW-UP vs. guopei, r(estimate), p-val,`pval') dec(3) excel append
 12. 
. }

Linear regression                                      Number of obs =   15987
                                                       F(  8,   298) = 1043.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5537
                                                       Root MSE      =  .66403

                                (Std. Err. adjusted for 299 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0000904   .0306048     0.00   0.998    -.0601386    .0603194
          2  |  -.0149546   .0280099    -0.53   0.594    -.0700769    .0401676
             |
  z_baseline |    .749061    .008246    90.84   0.000     .7328332    .7652888
             |
      blockZ |
         18  |  -.0724939   .0358437    -2.02   0.044    -.1430326   -.0019551
         19  |  -.0673749   .0469041    -1.44   0.152    -.1596802    .0249304
         27  |  -.0963447   .0381158    -2.53   0.012    -.1713551   -.0213344
         28  |   -.048558   .0353951    -1.37   0.171    -.1182141     .021098
         29  |  -.0404684   .0464921    -0.87   0.385    -.1319628    .0510259
             |
       _cons |   .0469113   .0299044     1.57   0.118    -.0119392    .1057618
------------------------------------------------------------------------------

 ( 1)  1.treatment - 2.treatment = 0

------------------------------------------------------------------------------
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .015045   .0293543     0.51   0.609     -.042723     .072813
------------------------------------------------------------------------------
c:\ado\plus/o/outreg2.ado
3ie_guopei_control_stu_zscore.xls
dir : seeout

Linear regression                                      Number of obs =   15713
                                                       F( 21,   296) =  453.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5632
                                                       Root MSE      =  .65687

                                (Std. Err. adjusted for 297 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |  -.0198098   .0296798    -0.67   0.505    -.0782199    .0386003
          2  |  -.0347422   .0272687    -1.27   0.204    -.0884074    .0189229
             |
  z_baseline |   .7239845   .0087403    82.83   0.000     .7067834    .7411856
        age2 |  -.0611984   .0073076    -8.37   0.000    -.0755797    -.046817
      female |   .1132865   .0139223     8.14   0.000     .0858873    .1406858
  father_jhs |  -.0136334   .0122517    -1.11   0.267    -.0377448    .0104781
  mother_jhs |  -.0084086   .0133978    -0.63   0.531    -.0347756    .0179583
        ses1 |  -.0091485   .0072003    -1.27   0.205    -.0233188    .0050218
  class_size |   .0020936   .0007441     2.81   0.005     .0006293     .003558
    t_female |   .0422156   .0232222     1.82   0.070     -.003486    .0879171
      t_age2 |    -.01129   .0064483    -1.75   0.081    -.0239803    .0014004
       t_exp |   .0056908   .0057269     0.99   0.321    -.0055798    .0169614
   t_4yrcoll |    .027578   .0341725     0.81   0.420     -.039674    .0948299
      t_cert |  -.1212391   .0528213    -2.30   0.022    -.2251921   -.0172862
t_major_math |  -.0188515   .0250231    -0.75   0.452    -.0680973    .0303943
t_rank_yigao |   .1018561    .032001     3.18   0.002     .0388778    .1648343
             |
      blockZ |
         18  |  -.0072623   .0351217    -0.21   0.836    -.0763821    .0618576
         19  |   .0696628   .0449721     1.55   0.122    -.0188427    .1581683
         27  |  -.0774985   .0371636    -2.09   0.038    -.1506368   -.0043602
         28  |   .0141589   .0355938     0.40   0.691    -.0558899    .0842078
         29  |   .0857283   .0477543     1.80   0.074    -.0082528    .1797093
             |
       _cons |   1.059293   .2056628     5.15   0.000     .6545459    1.464039
------------------------------------------------------------------------------

 ( 1)  1.treatment - 2.treatment = 0

------------------------------------------------------------------------------
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0149324   .0295219     0.51   0.613    -.0431669    .0730318
------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore.xls
dir : seeout

Linear regression                                      Number of obs =   14838
                                                       F(  8,   297) =  834.25
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4911
                                                       Root MSE      =  .71137

                                (Std. Err. adjusted for 298 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0264302   .0368665     0.72   0.474    -.0461224    .0989828
          2  |   .0233215   .0362508     0.64   0.521    -.0480195    .0946625
             |
  z_baseline |   .7218599   .0091007    79.32   0.000     .7039498      .73977
             |
      blockZ |
         18  |  -.0667323   .0449081    -1.49   0.138    -.1551107    .0216461
         19  |  -.1263084   .0573889    -2.20   0.029    -.2392489    -.013368
         27  |  -.0511856   .0507252    -1.01   0.314    -.1510119    .0486407
         28  |  -.0590411   .0458874    -1.29   0.199    -.1493468    .0312647
         29  |  -.0574792   .0541532    -1.06   0.289    -.1640518    .0490933
             |
       _cons |   -.019828   .0377565    -0.53   0.600    -.0941322    .0544762
------------------------------------------------------------------------------

 ( 1)  1.treatment - 2.treatment = 0

------------------------------------------------------------------------------
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0031088   .0375741     0.08   0.934    -.0708365    .0770541
------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore.xls
dir : seeout

Linear regression                                      Number of obs =   14599
                                                       F( 21,   295) =  345.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5042
                                                       Root MSE      =  .70195

                                (Std. Err. adjusted for 296 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |    .005249   .0349511     0.15   0.881     -.063536     .074034
          2  |  -.0064362   .0339426    -0.19   0.850    -.0732364     .060364
             |
  z_baseline |   .6903408   .0094778    72.84   0.000     .6716882    .7089934
        age2 |  -.0682914    .008483    -8.05   0.000    -.0849863   -.0515964
      female |     .14002   .0151332     9.25   0.000     .1102372    .1698027
  father_jhs |   -.001581   .0127085    -0.12   0.901    -.0265918    .0234299
  mother_jhs |  -.0048273   .0144758    -0.33   0.739    -.0333162    .0236616
        ses1 |   .0089556    .007712     1.16   0.246    -.0062219    .0241331
  class_size |    .003636   .0009707     3.75   0.000     .0017255    .0055464
    t_female |   .0596519   .0311133     1.92   0.056    -.0015803    .1208841
      t_age2 |  -.0066313   .0074405    -0.89   0.374    -.0212744    .0080119
       t_exp |   .0009331   .0071182     0.13   0.896    -.0130758     .014942
   t_4yrcoll |  -.0273706   .0437474    -0.63   0.532    -.1134673     .058726
      t_cert |  -.0239348   .0569976    -0.42   0.675    -.1361082    .0882386
t_major_math |  -.0017069   .0325303    -0.05   0.958    -.0657278     .062314
t_rank_yigao |   .1206762     .04058     2.97   0.003     .0408132    .2005392
             |
      blockZ |
         18  |   .0158809   .0443725     0.36   0.721    -.0714458    .1032076
         19  |   .0234211   .0574708     0.41   0.684    -.0896837    .1365258
         27  |  -.0141492   .0522597    -0.27   0.787    -.1169983    .0886999
         28  |   .0121408    .046262     0.26   0.793    -.0789046    .1031863
         29  |   .0821941   .0526641     1.56   0.120    -.0214508     .185839
             |
       _cons |   .7646032   .2317967     3.30   0.001     .3084184    1.220788
------------------------------------------------------------------------------

 ( 1)  1.treatment - 2.treatment = 0

------------------------------------------------------------------------------
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0116852   .0365169     0.32   0.749    -.0601815    .0835518
------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore.xls
dir : seeout

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. /* For Panel A - PD and PD + Follow-up vs. Control */
. eststo clear
unrecognized command:  eststo
r(199);

end of do-file

r(199);

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. /* For Panel A - PD and PD + Follow-up vs. Control */
. eststo clear
unrecognized command:  eststo
r(199);

end of do-file

r(199);

. ssc install estout
checking estout consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

. eststo clear

. 
. foreach var of varlist $mainoutcomes {
  2. 
.     regress `var' i.treatment z_baseline i.blockZ if spillover == 0, vce(cluster schid)
  3. 
.     eststo model1
  4. 
.     
. 
.     regress `var' i.treatment $covariates i.blockZ if spillover == 0, vce(cluster schid)
  5. 
.     eststo model2
  6. 
. }

Linear regression                                      Number of obs =   15987
                                                       F(  8,   298) = 1043.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5537
                                                       Root MSE      =  .66403

                                (Std. Err. adjusted for 299 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0000904   .0306048     0.00   0.998    -.0601386    .0603194
          2  |  -.0149546   .0280099    -0.53   0.594    -.0700769    .0401676
             |
  z_baseline |    .749061    .008246    90.84   0.000     .7328332    .7652888
             |
      blockZ |
         18  |  -.0724939   .0358437    -2.02   0.044    -.1430326   -.0019551
         19  |  -.0673749   .0469041    -1.44   0.152    -.1596802    .0249304
         27  |  -.0963447   .0381158    -2.53   0.012    -.1713551   -.0213344
         28  |   -.048558   .0353951    -1.37   0.171    -.1182141     .021098
         29  |  -.0404684   .0464921    -0.87   0.385    -.1319628    .0510259
             |
       _cons |   .0469113   .0299044     1.57   0.118    -.0119392    .1057618
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   15713
                                                       F( 21,   296) =  453.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5632
                                                       Root MSE      =  .65687

                                (Std. Err. adjusted for 297 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |  -.0198098   .0296798    -0.67   0.505    -.0782199    .0386003
          2  |  -.0347422   .0272687    -1.27   0.204    -.0884074    .0189229
             |
  z_baseline |   .7239845   .0087403    82.83   0.000     .7067834    .7411856
        age2 |  -.0611984   .0073076    -8.37   0.000    -.0755797    -.046817
      female |   .1132865   .0139223     8.14   0.000     .0858873    .1406858
  father_jhs |  -.0136334   .0122517    -1.11   0.267    -.0377448    .0104781
  mother_jhs |  -.0084086   .0133978    -0.63   0.531    -.0347756    .0179583
        ses1 |  -.0091485   .0072003    -1.27   0.205    -.0233188    .0050218
  class_size |   .0020936   .0007441     2.81   0.005     .0006293     .003558
    t_female |   .0422156   .0232222     1.82   0.070     -.003486    .0879171
      t_age2 |    -.01129   .0064483    -1.75   0.081    -.0239803    .0014004
       t_exp |   .0056908   .0057269     0.99   0.321    -.0055798    .0169614
   t_4yrcoll |    .027578   .0341725     0.81   0.420     -.039674    .0948299
      t_cert |  -.1212391   .0528213    -2.30   0.022    -.2251921   -.0172862
t_major_math |  -.0188515   .0250231    -0.75   0.452    -.0680973    .0303943
t_rank_yigao |   .1018561    .032001     3.18   0.002     .0388778    .1648343
             |
      blockZ |
         18  |  -.0072623   .0351217    -0.21   0.836    -.0763821    .0618576
         19  |   .0696628   .0449721     1.55   0.122    -.0188427    .1581683
         27  |  -.0774985   .0371636    -2.09   0.038    -.1506368   -.0043602
         28  |   .0141589   .0355938     0.40   0.691    -.0558899    .0842078
         29  |   .0857283   .0477543     1.80   0.074    -.0082528    .1797093
             |
       _cons |   1.059293   .2056628     5.15   0.000     .6545459    1.464039
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   14838
                                                       F(  8,   297) =  834.25
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4911
                                                       Root MSE      =  .71137

                                (Std. Err. adjusted for 298 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0264302   .0368665     0.72   0.474    -.0461224    .0989828
          2  |   .0233215   .0362508     0.64   0.521    -.0480195    .0946625
             |
  z_baseline |   .7218599   .0091007    79.32   0.000     .7039498      .73977
             |
      blockZ |
         18  |  -.0667323   .0449081    -1.49   0.138    -.1551107    .0216461
         19  |  -.1263084   .0573889    -2.20   0.029    -.2392489    -.013368
         27  |  -.0511856   .0507252    -1.01   0.314    -.1510119    .0486407
         28  |  -.0590411   .0458874    -1.29   0.199    -.1493468    .0312647
         29  |  -.0574792   .0541532    -1.06   0.289    -.1640518    .0490933
             |
       _cons |   -.019828   .0377565    -0.53   0.600    -.0941322    .0544762
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   14599
                                                       F( 21,   295) =  345.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5042
                                                       Root MSE      =  .70195

                                (Std. Err. adjusted for 296 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |    .005249   .0349511     0.15   0.881     -.063536     .074034
          2  |  -.0064362   .0339426    -0.19   0.850    -.0732364     .060364
             |
  z_baseline |   .6903408   .0094778    72.84   0.000     .6716882    .7089934
        age2 |  -.0682914    .008483    -8.05   0.000    -.0849863   -.0515964
      female |     .14002   .0151332     9.25   0.000     .1102372    .1698027
  father_jhs |   -.001581   .0127085    -0.12   0.901    -.0265918    .0234299
  mother_jhs |  -.0048273   .0144758    -0.33   0.739    -.0333162    .0236616
        ses1 |   .0089556    .007712     1.16   0.246    -.0062219    .0241331
  class_size |    .003636   .0009707     3.75   0.000     .0017255    .0055464
    t_female |   .0596519   .0311133     1.92   0.056    -.0015803    .1208841
      t_age2 |  -.0066313   .0074405    -0.89   0.374    -.0212744    .0080119
       t_exp |   .0009331   .0071182     0.13   0.896    -.0130758     .014942
   t_4yrcoll |  -.0273706   .0437474    -0.63   0.532    -.1134673     .058726
      t_cert |  -.0239348   .0569976    -0.42   0.675    -.1361082    .0882386
t_major_math |  -.0017069   .0325303    -0.05   0.958    -.0657278     .062314
t_rank_yigao |   .1206762     .04058     2.97   0.003     .0408132    .2005392
             |
      blockZ |
         18  |   .0158809   .0443725     0.36   0.721    -.0714458    .1032076
         19  |   .0234211   .0574708     0.41   0.684    -.0896837    .1365258
         27  |  -.0141492   .0522597    -0.27   0.787    -.1169983    .0886999
         28  |   .0121408    .046262     0.26   0.793    -.0789046    .1031863
         29  |   .0821941   .0526641     1.56   0.120    -.0214508     .185839
             |
       _cons |   .7646032   .2317967     3.30   0.001     .3084184    1.220788
------------------------------------------------------------------------------

. 
. 
. 
. esttab model1 model2 using "3ie_guopei_control_stu_zscore.xls", ///
option / not allowed
r(198);

. 
.     cells("b(star fmt(%9.3f)) se(fmt(%9.3f))") ///
unrecognized command:  cells
r(199);

. 
.     starlevels(* 0.1 ** 0.05 *** 0.01) ///
unrecognized command:  starlevels
r(199);

. 
.     label unstack noconstant mlabels("PD" "PD + Follow-up") ///
invalid syntax
r(198);

. 
.     varwidth(15) replace
unrecognized command:  varwidth
r(199);

. 
. 
. 
. 
. 
. eststo clear

. 
. foreach var of varlist $mainoutcomes {
  2. 
.     regress `var' i.treatment z_baseline i.blockZ if spillover == 0, vce(cluster schid)
  3. 
.     eststo model1
  4. 
.     
. 
.     regress `var' i.treatment $covariates i.blockZ if spillover == 0, vce(cluster schid)
  5. 
.     eststo model2
  6. 
. }

Linear regression                                      Number of obs =   15987
                                                       F(  8,   298) = 1043.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5537
                                                       Root MSE      =  .66403

                                (Std. Err. adjusted for 299 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0000904   .0306048     0.00   0.998    -.0601386    .0603194
          2  |  -.0149546   .0280099    -0.53   0.594    -.0700769    .0401676
             |
  z_baseline |    .749061    .008246    90.84   0.000     .7328332    .7652888
             |
      blockZ |
         18  |  -.0724939   .0358437    -2.02   0.044    -.1430326   -.0019551
         19  |  -.0673749   .0469041    -1.44   0.152    -.1596802    .0249304
         27  |  -.0963447   .0381158    -2.53   0.012    -.1713551   -.0213344
         28  |   -.048558   .0353951    -1.37   0.171    -.1182141     .021098
         29  |  -.0404684   .0464921    -0.87   0.385    -.1319628    .0510259
             |
       _cons |   .0469113   .0299044     1.57   0.118    -.0119392    .1057618
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   15713
                                                       F( 21,   296) =  453.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5632
                                                       Root MSE      =  .65687

                                (Std. Err. adjusted for 297 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |  -.0198098   .0296798    -0.67   0.505    -.0782199    .0386003
          2  |  -.0347422   .0272687    -1.27   0.204    -.0884074    .0189229
             |
  z_baseline |   .7239845   .0087403    82.83   0.000     .7067834    .7411856
        age2 |  -.0611984   .0073076    -8.37   0.000    -.0755797    -.046817
      female |   .1132865   .0139223     8.14   0.000     .0858873    .1406858
  father_jhs |  -.0136334   .0122517    -1.11   0.267    -.0377448    .0104781
  mother_jhs |  -.0084086   .0133978    -0.63   0.531    -.0347756    .0179583
        ses1 |  -.0091485   .0072003    -1.27   0.205    -.0233188    .0050218
  class_size |   .0020936   .0007441     2.81   0.005     .0006293     .003558
    t_female |   .0422156   .0232222     1.82   0.070     -.003486    .0879171
      t_age2 |    -.01129   .0064483    -1.75   0.081    -.0239803    .0014004
       t_exp |   .0056908   .0057269     0.99   0.321    -.0055798    .0169614
   t_4yrcoll |    .027578   .0341725     0.81   0.420     -.039674    .0948299
      t_cert |  -.1212391   .0528213    -2.30   0.022    -.2251921   -.0172862
t_major_math |  -.0188515   .0250231    -0.75   0.452    -.0680973    .0303943
t_rank_yigao |   .1018561    .032001     3.18   0.002     .0388778    .1648343
             |
      blockZ |
         18  |  -.0072623   .0351217    -0.21   0.836    -.0763821    .0618576
         19  |   .0696628   .0449721     1.55   0.122    -.0188427    .1581683
         27  |  -.0774985   .0371636    -2.09   0.038    -.1506368   -.0043602
         28  |   .0141589   .0355938     0.40   0.691    -.0558899    .0842078
         29  |   .0857283   .0477543     1.80   0.074    -.0082528    .1797093
             |
       _cons |   1.059293   .2056628     5.15   0.000     .6545459    1.464039
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   14838
                                                       F(  8,   297) =  834.25
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4911
                                                       Root MSE      =  .71137

                                (Std. Err. adjusted for 298 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0264302   .0368665     0.72   0.474    -.0461224    .0989828
          2  |   .0233215   .0362508     0.64   0.521    -.0480195    .0946625
             |
  z_baseline |   .7218599   .0091007    79.32   0.000     .7039498      .73977
             |
      blockZ |
         18  |  -.0667323   .0449081    -1.49   0.138    -.1551107    .0216461
         19  |  -.1263084   .0573889    -2.20   0.029    -.2392489    -.013368
         27  |  -.0511856   .0507252    -1.01   0.314    -.1510119    .0486407
         28  |  -.0590411   .0458874    -1.29   0.199    -.1493468    .0312647
         29  |  -.0574792   .0541532    -1.06   0.289    -.1640518    .0490933
             |
       _cons |   -.019828   .0377565    -0.53   0.600    -.0941322    .0544762
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   14599
                                                       F( 21,   295) =  345.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5042
                                                       Root MSE      =  .70195

                                (Std. Err. adjusted for 296 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |    .005249   .0349511     0.15   0.881     -.063536     .074034
          2  |  -.0064362   .0339426    -0.19   0.850    -.0732364     .060364
             |
  z_baseline |   .6903408   .0094778    72.84   0.000     .6716882    .7089934
        age2 |  -.0682914    .008483    -8.05   0.000    -.0849863   -.0515964
      female |     .14002   .0151332     9.25   0.000     .1102372    .1698027
  father_jhs |   -.001581   .0127085    -0.12   0.901    -.0265918    .0234299
  mother_jhs |  -.0048273   .0144758    -0.33   0.739    -.0333162    .0236616
        ses1 |   .0089556    .007712     1.16   0.246    -.0062219    .0241331
  class_size |    .003636   .0009707     3.75   0.000     .0017255    .0055464
    t_female |   .0596519   .0311133     1.92   0.056    -.0015803    .1208841
      t_age2 |  -.0066313   .0074405    -0.89   0.374    -.0212744    .0080119
       t_exp |   .0009331   .0071182     0.13   0.896    -.0130758     .014942
   t_4yrcoll |  -.0273706   .0437474    -0.63   0.532    -.1134673     .058726
      t_cert |  -.0239348   .0569976    -0.42   0.675    -.1361082    .0882386
t_major_math |  -.0017069   .0325303    -0.05   0.958    -.0657278     .062314
t_rank_yigao |   .1206762     .04058     2.97   0.003     .0408132    .2005392
             |
      blockZ |
         18  |   .0158809   .0443725     0.36   0.721    -.0714458    .1032076
         19  |   .0234211   .0574708     0.41   0.684    -.0896837    .1365258
         27  |  -.0141492   .0522597    -0.27   0.787    -.1169983    .0886999
         28  |   .0121408    .046262     0.26   0.793    -.0789046    .1031863
         29  |   .0821941   .0526641     1.56   0.120    -.0214508     .185839
             |
       _cons |   .7646032   .2317967     3.30   0.001     .3084184    1.220788
------------------------------------------------------------------------------

. 
. 
. 
. esttab model1 model2 using "3ie_PD+Evaluation_PD_stu_zscore.xls", ///
option / not allowed
r(198);

. 
.     cells("b(star fmt(%9.3f)) se(fmt(%9.3f))") ///
unrecognized command:  cells
r(199);

. 
.     starlevels(* 0.1 ** 0.05 *** 0.01) ///
unrecognized command:  starlevels
r(199);

. 
.     label unstack noconstant mlabels("PD + Evaluation") ///
invalid syntax
r(198);

. 
.     varwidth(15) replace
unrecognized command:  varwidth
r(199);

. 
. 
. 
. 
. 
. eststo clear

. 
. foreach var of varlist $mainoutcomes {
  2. 
.     regress `var' i.treatment z_baseline i.blockZ if spillover == 0, vce(cluster schid)
  3. 
.     eststo model1
  4. 
.     
. 
.     regress `var' i.treatment $covariates i.blockZ if spillover == 0, vce(cluster schid)
  5. 
.     eststo model2
  6. 
. }

Linear regression                                      Number of obs =   15987
                                                       F(  8,   298) = 1043.13
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5537
                                                       Root MSE      =  .66403

                                (Std. Err. adjusted for 299 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0000904   .0306048     0.00   0.998    -.0601386    .0603194
          2  |  -.0149546   .0280099    -0.53   0.594    -.0700769    .0401676
             |
  z_baseline |    .749061    .008246    90.84   0.000     .7328332    .7652888
             |
      blockZ |
         18  |  -.0724939   .0358437    -2.02   0.044    -.1430326   -.0019551
         19  |  -.0673749   .0469041    -1.44   0.152    -.1596802    .0249304
         27  |  -.0963447   .0381158    -2.53   0.012    -.1713551   -.0213344
         28  |   -.048558   .0353951    -1.37   0.171    -.1182141     .021098
         29  |  -.0404684   .0464921    -0.87   0.385    -.1319628    .0510259
             |
       _cons |   .0469113   .0299044     1.57   0.118    -.0119392    .1057618
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   15713
                                                       F( 21,   296) =  453.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5632
                                                       Root MSE      =  .65687

                                (Std. Err. adjusted for 297 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |  -.0198098   .0296798    -0.67   0.505    -.0782199    .0386003
          2  |  -.0347422   .0272687    -1.27   0.204    -.0884074    .0189229
             |
  z_baseline |   .7239845   .0087403    82.83   0.000     .7067834    .7411856
        age2 |  -.0611984   .0073076    -8.37   0.000    -.0755797    -.046817
      female |   .1132865   .0139223     8.14   0.000     .0858873    .1406858
  father_jhs |  -.0136334   .0122517    -1.11   0.267    -.0377448    .0104781
  mother_jhs |  -.0084086   .0133978    -0.63   0.531    -.0347756    .0179583
        ses1 |  -.0091485   .0072003    -1.27   0.205    -.0233188    .0050218
  class_size |   .0020936   .0007441     2.81   0.005     .0006293     .003558
    t_female |   .0422156   .0232222     1.82   0.070     -.003486    .0879171
      t_age2 |    -.01129   .0064483    -1.75   0.081    -.0239803    .0014004
       t_exp |   .0056908   .0057269     0.99   0.321    -.0055798    .0169614
   t_4yrcoll |    .027578   .0341725     0.81   0.420     -.039674    .0948299
      t_cert |  -.1212391   .0528213    -2.30   0.022    -.2251921   -.0172862
t_major_math |  -.0188515   .0250231    -0.75   0.452    -.0680973    .0303943
t_rank_yigao |   .1018561    .032001     3.18   0.002     .0388778    .1648343
             |
      blockZ |
         18  |  -.0072623   .0351217    -0.21   0.836    -.0763821    .0618576
         19  |   .0696628   .0449721     1.55   0.122    -.0188427    .1581683
         27  |  -.0774985   .0371636    -2.09   0.038    -.1506368   -.0043602
         28  |   .0141589   .0355938     0.40   0.691    -.0558899    .0842078
         29  |   .0857283   .0477543     1.80   0.074    -.0082528    .1797093
             |
       _cons |   1.059293   .2056628     5.15   0.000     .6545459    1.464039
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   14838
                                                       F(  8,   297) =  834.25
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4911
                                                       Root MSE      =  .71137

                                (Std. Err. adjusted for 298 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |   .0264302   .0368665     0.72   0.474    -.0461224    .0989828
          2  |   .0233215   .0362508     0.64   0.521    -.0480195    .0946625
             |
  z_baseline |   .7218599   .0091007    79.32   0.000     .7039498      .73977
             |
      blockZ |
         18  |  -.0667323   .0449081    -1.49   0.138    -.1551107    .0216461
         19  |  -.1263084   .0573889    -2.20   0.029    -.2392489    -.013368
         27  |  -.0511856   .0507252    -1.01   0.314    -.1510119    .0486407
         28  |  -.0590411   .0458874    -1.29   0.199    -.1493468    .0312647
         29  |  -.0574792   .0541532    -1.06   0.289    -.1640518    .0490933
             |
       _cons |   -.019828   .0377565    -0.53   0.600    -.0941322    .0544762
------------------------------------------------------------------------------

Linear regression                                      Number of obs =   14599
                                                       F( 21,   295) =  345.08
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5042
                                                       Root MSE      =  .70195

                                (Std. Err. adjusted for 296 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   treatment |
          1  |    .005249   .0349511     0.15   0.881     -.063536     .074034
          2  |  -.0064362   .0339426    -0.19   0.850    -.0732364     .060364
             |
  z_baseline |   .6903408   .0094778    72.84   0.000     .6716882    .7089934
        age2 |  -.0682914    .008483    -8.05   0.000    -.0849863   -.0515964
      female |     .14002   .0151332     9.25   0.000     .1102372    .1698027
  father_jhs |   -.001581   .0127085    -0.12   0.901    -.0265918    .0234299
  mother_jhs |  -.0048273   .0144758    -0.33   0.739    -.0333162    .0236616
        ses1 |   .0089556    .007712     1.16   0.246    -.0062219    .0241331
  class_size |    .003636   .0009707     3.75   0.000     .0017255    .0055464
    t_female |   .0596519   .0311133     1.92   0.056    -.0015803    .1208841
      t_age2 |  -.0066313   .0074405    -0.89   0.374    -.0212744    .0080119
       t_exp |   .0009331   .0071182     0.13   0.896    -.0130758     .014942
   t_4yrcoll |  -.0273706   .0437474    -0.63   0.532    -.1134673     .058726
      t_cert |  -.0239348   .0569976    -0.42   0.675    -.1361082    .0882386
t_major_math |  -.0017069   .0325303    -0.05   0.958    -.0657278     .062314
t_rank_yigao |   .1206762     .04058     2.97   0.003     .0408132    .2005392
             |
      blockZ |
         18  |   .0158809   .0443725     0.36   0.721    -.0714458    .1032076
         19  |   .0234211   .0574708     0.41   0.684    -.0896837    .1365258
         27  |  -.0141492   .0522597    -0.27   0.787    -.1169983    .0886999
         28  |   .0121408    .046262     0.26   0.793    -.0789046    .1031863
         29  |   .0821941   .0526641     1.56   0.120    -.0214508     .185839
             |
       _cons |   .7646032   .2317967     3.30   0.001     .3084184    1.220788
------------------------------------------------------------------------------

. 
. 
. 
. esttab model1 model2 using "3ie_PD+Evaluation_Control_stu_zscore.xls", ///
option / not allowed
r(198);

. 
.     cells("b(star fmt(%9.3f)) se(fmt(%9.3f))") ///
unrecognized command:  cells
r(199);

. 
.     starlevels(* 0.1 ** 0.05 *** 0.01) ///
unrecognized command:  starlevels
r(199);

. 
.     label unstack noconstant mlabels("PD + Evaluation - Control") ///
invalid syntax
r(198);

. 
.     varwidth(15) replace
unrecognized command:  varwidth
r(199);

. esttab model1 model2 using "3ie_PD+Evaluation_Control_stu_zscore.xls", ///
option / not allowed
r(198);

. 
.     cells(b(star fmt(%9.3f)) se(fmt(%9.3f))) ///
unrecognized command:  cells
r(199);

. 
.     starlevels(* 0.1 ** 0.05 *** 0.01) ///
unrecognized command:  starlevels
r(199);

. 
.     label unstack noconstant mlabels("PD + Evaluation - Control") ///
invalid syntax
r(198);

. 
.     varwidth(15) replace
unrecognized command:  varwidth
r(199);

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. /*compare in-person (in NTTP only or NTTP + follow-up) VERSUS no-in-person (in NTTP only or NTTP + follow-up)*/
. foreach var of varlist $mainoutcomes {
  2.         regress `var' i.in_person z_baseline i.blockZZ if treatment!= 0 & spillover == 0, vce(cluster schid)
  3.         outreg2 using "3ie_inpersonYN_stu_zscore.xls", dec(3) excel append
  4. 
.         regress `var' i.in_person $covariates i.blockZZ if treatment!= 0 & spillover == 0, vce(cluster schid)
  5.         outreg2 using "3ie_inpersonYN_stu_zscore_cov.xls", dec(3) excel append
  6. }

Linear regression                                      Number of obs =   10725
                                                       F( 13,   198) =  540.73
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5660
                                                       Root MSE      =  .65495

                                   (Std. Err. adjusted for 199 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0080316   .0287632     0.28   0.780    -.0486899    .0647531
     z_baseline |   .7607173   .0093798    81.10   0.000     .7422203    .7792144
                |
        blockZZ |
            12  |  -.0209904   .0638102    -0.33   0.743    -.1468252    .1048445
            21  |  -.1410433   .0732823    -1.92   0.056    -.2855573    .0034708
            22  |  -.0595902   .0484696    -1.23   0.220    -.1551732    .0359928
            31  |  -.0687972   .0731983    -0.94   0.348    -.2131455    .0755511
            32  |  -.0496542   .0490587    -1.01   0.313    -.1463989    .0470904
            41  |  -.0901764    .063811    -1.41   0.159    -.2160128      .03566
            42  |  -.1415247   .0650239    -2.18   0.031     -.269753   -.0132964
            51  |  -.0650167   .0594636    -1.09   0.276      -.18228    .0522465
            52  |  -.1082785   .0571112    -1.90   0.059    -.2209029    .0043458
            61  |  -.0500655   .0844745    -0.59   0.554    -.2166507    .1165196
            62  |  -.1216238   .0557935    -2.18   0.030    -.2316496    -.011598
                |
          _cons |   .0542808   .0417693     1.30   0.195    -.0280891    .1366507
---------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore.xls
dir : seeout

Linear regression                                      Number of obs =   10483
                                                       F( 25,   196) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5752
                                                       Root MSE      =  .64825

                                   (Std. Err. adjusted for 197 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0054076   .0283579     0.19   0.849    -.0505181    .0613332
     z_baseline |   .7376076   .0104105    70.85   0.000     .7170767    .7581386
           age2 |  -.0565551   .0087676    -6.45   0.000     -.073846   -.0392642
         female |   .1058013   .0164944     6.41   0.000     .0732721    .1383305
     father_jhs |   -.015877   .0141719    -1.12   0.264     -.043826    .0120721
     mother_jhs |  -.0103795    .016759    -0.62   0.536    -.0434306    .0226715
           ses1 |  -.0028992    .008982    -0.32   0.747     -.020613    .0148146
     class_size |   .0014578   .0008679     1.68   0.095    -.0002539    .0031695
       t_female |   .0274144   .0269058     1.02   0.310    -.0256476    .0804764
         t_age2 |  -.0017104   .0065518    -0.26   0.794    -.0146314    .0112106
          t_exp |  -.0045926   .0064469    -0.71   0.477    -.0173067    .0081215
      t_4yrcoll |  -.0394856   .0511738    -0.77   0.441    -.1404076    .0614364
         t_cert |   .0624483   .0739009     0.85   0.399    -.0832947    .2081914
   t_major_math |  -.0526827   .0316837    -1.66   0.098    -.1151675     .009802
   t_rank_yigao |   .0998114   .0411134     2.43   0.016     .0187301    .1808928
                |
        blockZZ |
            12  |  -.0262973   .0577041    -0.46   0.649    -.1400979    .0875032
            21  |  -.0715356   .0700945    -1.02   0.309    -.2097718    .0667006
            22  |  -.0050057   .0511307    -0.10   0.922    -.1058428    .0958313
            31  |   .0494679   .0714968     0.69   0.490     -.091534    .1904697
            32  |   .0577515   .0461743     1.25   0.213    -.0333108    .1488137
            41  |  -.0831108   .0640926    -1.30   0.196    -.2095104    .0432888
            42  |  -.1295574   .0637279    -2.03   0.043    -.2552379   -.0038769
            51  |  -.0282955   .0619706    -0.46   0.648    -.1505102    .0939193
            52  |  -.0507368   .0567187    -0.89   0.372     -.162594    .0611204
            61  |   .0510796   .0808092     0.63   0.528    -.1082876    .2104468
            62  |  -.0264153   .0570448    -0.46   0.644    -.1389156     .086085
                |
          _cons |   .7026035   .2214188     3.17   0.002     .2659343    1.139273
---------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_cov.xls
dir : seeout

Linear regression                                      Number of obs =    9934
                                                       F( 13,   197) =  344.04
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4993
                                                       Root MSE      =  .69872

                                   (Std. Err. adjusted for 198 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0432258   .0366789     1.18   0.240    -.0291079    .1155595
     z_baseline |   .7230623    .011139    64.91   0.000     .7010954    .7450293
                |
        blockZZ |
            12  |  -.0613931    .089838    -0.68   0.495    -.2385607    .1157745
            21  |  -.1511623   .1003068    -1.51   0.133    -.3489752    .0466506
            22  |  -.0490742    .078907    -0.62   0.535     -.204685    .1065366
            31  |  -.1181125   .0989392    -1.19   0.234    -.3132285    .0770035
            32  |  -.0736917   .1155968    -0.64   0.525    -.3016578    .1542743
            41  |  -.0518849   .0817023    -0.64   0.526    -.2130084    .1092386
            42  |  -.0887887   .0880339    -1.01   0.314    -.2623985     .084821
            51  |  -.1343938    .082563    -1.63   0.105    -.2972146     .028427
            52  |  -.0844158    .089895    -0.94   0.349    -.2616959    .0928643
            61  |  -.0358581   .0956146    -0.38   0.708    -.2244176    .1527014
            62  |  -.1532741   .0877053    -1.75   0.082    -.3262359    .0196877
                |
          _cons |   .0054921    .069586     0.08   0.937     -.131737    .1427213
---------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore.xls
dir : seeout

Linear regression                                      Number of obs =    9726
                                                       F( 25,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5166
                                                       Root MSE      =  .68659

                                   (Std. Err. adjusted for 196 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0305453   .0344275     0.89   0.376    -.0373527    .0984432
     z_baseline |   .6916197   .0121284    57.02   0.000     .6676999    .7155395
           age2 |  -.0675444   .0101539    -6.65   0.000      -.08757   -.0475188
         female |   .1294822    .017757     7.29   0.000     .0944618    .1645026
     father_jhs |  -.0162329   .0145644    -1.11   0.266    -.0449569    .0124911
     mother_jhs |   .0159282   .0174438     0.91   0.362    -.0184745    .0503309
           ses1 |   .0059419   .0093093     0.64   0.524    -.0124179    .0243018
     class_size |   .0026931   .0010709     2.51   0.013      .000581    .0048051
       t_female |   .0511654   .0359212     1.42   0.156    -.0196785    .1220094
         t_age2 |  -.0041422   .0088337    -0.47   0.640     -.021564    .0132797
          t_exp |  -.0085729   .0081546    -1.05   0.294    -.0246555    .0075097
      t_4yrcoll |  -.1925086   .0546964    -3.52   0.001    -.3003811   -.0846362
         t_cert |   .1984692   .0885702     2.24   0.026     .0237907    .3731476
   t_major_math |  -.0186993   .0356635    -0.52   0.601    -.0890349    .0516363
   t_rank_yigao |   .1495569   .0472916     3.16   0.002     .0562881    .2428257
                |
        blockZZ |
            12  |  -.0785359   .0733825    -1.07   0.286    -.2232612    .0661893
            21  |  -.0337233   .0950129    -0.35   0.723    -.2211081    .1536616
            22  |   .0267809   .0741828     0.36   0.718    -.1195226    .1730845
            31  |   .0317211   .0959094     0.33   0.741    -.1574319     .220874
            32  |   .0273769    .116156     0.24   0.814    -.2017065    .2564603
            41  |   .0034133   .0799942     0.04   0.966    -.1543517    .1611782
            42  |  -.0578137   .0782236    -0.74   0.461    -.2120867    .0964593
            51  |  -.1129113   .0745459    -1.51   0.131    -.2599311    .0341085
            52  |  -.0360823   .0855172    -0.42   0.674    -.2047398    .1325752
            61  |    .065533   .0848442     0.77   0.441    -.1017971    .2328631
            62  |  -.0460662   .0764084    -0.60   0.547    -.1967592    .1046268
                |
          _cons |   .7084308   .2822394     2.51   0.013     .1517971    1.265065
---------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_cov.xls
dir : seeout

. 
. 
. 
. /*compare in-person with control*/
. foreach var of varlist $mainoutcomes {
  2.         regress `var' i.in_person z_baseline i.blockZ if spillover == 0 & ((treatment == 1 & in_person == 1) | (treatment == 2 & in_person == 1) | treatment == 0
> ), vce(cluster schid)
  3.         outreg2 using "3ie_inpersonY_control_stu_zscore.xls", dec(3) excel append
  4. 
.         regress `var' i.in_person $covariates i.blockZ if spillover == 0 & ((treatment == 1 & in_person == 1) | (treatment == 2 & in_person == 1) | treatment == 0),
>  vce(cluster schid)
  5.         outreg2 using "3ie_inpersonY_control_stu_zscore_cov.xls", dec(3) excel append
  6. }

Linear regression                                      Number of obs =   10967
                                                       F(  7,   202) =  749.29
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5443
                                                       Root MSE      =  .66812

                                   (Std. Err. adjusted for 203 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |  -.0030113   .0284127    -0.11   0.916    -.0590349    .0530122
     z_baseline |    .737901   .0103016    71.63   0.000     .7175886    .7582135
                |
         blockZ |
            18  |  -.0606078   .0395619    -1.53   0.127     -.138615    .0173994
            19  |  -.0845743   .0615527    -1.37   0.171    -.2059425     .036794
            27  |  -.0818675   .0430114    -1.90   0.058    -.1666764    .0029414
            28  |  -.0396721   .0417116    -0.95   0.343     -.121918    .0425738
            29  |  -.0308503   .0540218    -0.57   0.569    -.1373692    .0756686
                |
          _cons |    .042501   .0325515     1.31   0.193    -.0216833    .1066852
---------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore.xls
dir : seeout

Linear regression                                      Number of obs =   10774
                                                       F( 19,   201) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5543
                                                       Root MSE      =  .66062

                                   (Std. Err. adjusted for 202 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |  -.0222717   .0278121    -0.80   0.424    -.0771126    .0325691
     z_baseline |   .7137214   .0107063    66.66   0.000     .6926103    .7348325
           age2 |   -.064774   .0086547    -7.48   0.000    -.0818396   -.0477083
         female |   .1193432   .0175197     6.81   0.000     .0847972    .1538892
     father_jhs |  -.0130923   .0151744    -0.86   0.389    -.0430138    .0168292
     mother_jhs |   .0008559   .0165853     0.05   0.959    -.0318477    .0335594
           ses1 |  -.0116072   .0083698    -1.39   0.167    -.0281111    .0048966
     class_size |   .0020153   .0009333     2.16   0.032     .0001749    .0038557
       t_female |   .0446875    .028803     1.55   0.122    -.0121073    .1014822
         t_age2 |  -.0108014   .0093747    -1.15   0.251    -.0292869    .0076841
          t_exp |   .0051589   .0080529     0.64   0.522    -.0107201     .021038
      t_4yrcoll |   .0386577   .0377514     1.02   0.307    -.0357819    .1130973
         t_cert |  -.1486352   .0422478    -3.52   0.001    -.2319409   -.0653295
   t_major_math |  -.0134814   .0294695    -0.46   0.648    -.0715904    .0446275
   t_rank_yigao |   .0795145   .0396777     2.00   0.046     .0012765    .1577525
                |
         blockZ |
            18  |   .0210407   .0403176     0.52   0.602     -.058459    .1005404
            19  |   .0743105   .0593443     1.25   0.212    -.0427068    .1913278
            27  |  -.0641348   .0433771    -1.48   0.141    -.1496673    .0213977
            28  |    .041375    .043692     0.95   0.345    -.0447785    .1275286
            29  |   .1167636   .0569197     2.05   0.042     .0045273    .2289999
                |
          _cons |   1.111422   .2844272     3.91   0.000     .5505781    1.672266
---------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_cov.xls
dir : seeout

Linear regression                                      Number of obs =   10168
                                                       F(  7,   201) =  757.87
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4933
                                                       Root MSE      =  .70931

                                   (Std. Err. adjusted for 202 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0441813   .0350736     1.26   0.209    -.0249781    .1133406
     z_baseline |   .7209559   .0102993    70.00   0.000     .7006473    .7412644
                |
         blockZ |
            18  |  -.0196567   .0500846    -0.39   0.695    -.1184154     .079102
            19  |  -.1199732   .0618475    -1.94   0.054    -.2419263      .00198
            27  |  -.0072915   .0623814    -0.12   0.907    -.1302975    .1157144
            28  |  -.0170968    .053247    -0.32   0.748    -.1220911    .0878976
            29  |   .0205408   .0612553     0.34   0.738    -.1002446    .1413262
                |
          _cons |  -.0518017   .0411885    -1.26   0.210    -.1330186    .0294152
---------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore.xls
dir : seeout

Linear regression                                      Number of obs =   10006
                                                       F( 19,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5066
                                                       Root MSE      =  .69977

                                   (Std. Err. adjusted for 201 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |    .010695   .0316032     0.34   0.735    -.0516232    .0730133
     z_baseline |   .6898746   .0105418    65.44   0.000     .6690873    .7106619
           age2 |  -.0702849   .0101387    -6.93   0.000    -.0902773   -.0502924
         female |   .1510757   .0186418     8.10   0.000      .114316    .1878354
     father_jhs |   .0029501   .0157033     0.19   0.851    -.0280152    .0339154
     mother_jhs |  -.0226649   .0155978    -1.45   0.148    -.0534222    .0080924
           ses1 |   .0109007   .0087247     1.25   0.213    -.0063035    .0281048
     class_size |   .0039355   .0012071     3.26   0.001     .0015552    .0063158
       t_female |   .0545114     .03769     1.45   0.150    -.0198094    .1288322
         t_age2 |  -.0019063   .0093563    -0.20   0.839    -.0203559    .0165434
          t_exp |  -.0025995   .0090343    -0.29   0.774    -.0204142    .0152152
      t_4yrcoll |  -.0005046   .0481031    -0.01   0.992    -.0953589    .0943496
         t_cert |  -.0404833    .051404    -0.79   0.432    -.1418468    .0608801
   t_major_math |  -.0056737   .0386278    -0.15   0.883    -.0818436    .0704963
   t_rank_yigao |   .1050746   .0492062     2.14   0.034     .0080451     .202104
                |
         blockZ |
            18  |   .0762601   .0468265     1.63   0.105    -.0160769    .1685972
            19  |   .0426164   .0608881     0.70   0.485    -.0774485    .1626814
            27  |   .0171855   .0672855     0.26   0.799    -.1154944    .1498655
            28  |   .0604083   .0532538     1.13   0.258    -.0446026    .1654192
            29  |   .1746414   .0606421     2.88   0.004     .0550615    .2942213
                |
          _cons |   .6396173   .2823669     2.27   0.025     .0828191    1.196415
---------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_cov.xls
dir : seeout

. ovariates i.blockZ if spillover == 0 & ((treatment == 1 & in_person == 1) | (treatment == 2 & in_person == 1) | treatment == 0), vce(cluster schid)
unrecognized command:  ovariates
r(199);

end of do-file

r(199);

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. /* Compare in-person (in NTTP only or NTTP + follow-up) VERSUS no-in-person (in NTTP only or NTTP + follow-up) */
. foreach var of varlist $mainoutcomes {
  2.     regress `var' i.in_person z_baseline i.blockZZ if treatment != 0 & spillover == 0, vce(cluster schid)
  3.     estimates store model1
  4. 
.     regress `var' i.in_person $covariates i.blockZZ if treatment != 0 & spillover == 0, vce(cluster schid)
  5.     estimates store model2
  6. 
.     /* Save the regression results in separate models and then create the table */
.     esttab model1 model2 using "3ie_inpersonYN_stu_zscore.xls", ///
>     cells("b(fmt(%9.3f) se(fmt(%9.3f)))") label unstack noobs ///
>     mlabels("PD" "PD + Follow-up") ///
>     stats(coef se) replace
  7.     
.     /* Repeat the process for different comparisons */
. }

Linear regression                                      Number of obs =   10725
                                                       F( 13,   198) =  540.73
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5660
                                                       Root MSE      =  .65495

                                   (Std. Err. adjusted for 199 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0080316   .0287632     0.28   0.780    -.0486899    .0647531
     z_baseline |   .7607173   .0093798    81.10   0.000     .7422203    .7792144
                |
        blockZZ |
            12  |  -.0209904   .0638102    -0.33   0.743    -.1468252    .1048445
            21  |  -.1410433   .0732823    -1.92   0.056    -.2855573    .0034708
            22  |  -.0595902   .0484696    -1.23   0.220    -.1551732    .0359928
            31  |  -.0687972   .0731983    -0.94   0.348    -.2131455    .0755511
            32  |  -.0496542   .0490587    -1.01   0.313    -.1463989    .0470904
            41  |  -.0901764    .063811    -1.41   0.159    -.2160128      .03566
            42  |  -.1415247   .0650239    -2.18   0.031     -.269753   -.0132964
            51  |  -.0650167   .0594636    -1.09   0.276      -.18228    .0522465
            52  |  -.1082785   .0571112    -1.90   0.059    -.2209029    .0043458
            61  |  -.0500655   .0844745    -0.59   0.554    -.2166507    .1165196
            62  |  -.1216238   .0557935    -2.18   0.030    -.2316496    -.011598
                |
          _cons |   .0542808   .0417693     1.30   0.195    -.0280891    .1366507
---------------------------------------------------------------------------------

Linear regression                                      Number of obs =   10483
                                                       F( 25,   196) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5752
                                                       Root MSE      =  .64825

                                   (Std. Err. adjusted for 197 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0054076   .0283579     0.19   0.849    -.0505181    .0613332
     z_baseline |   .7376076   .0104105    70.85   0.000     .7170767    .7581386
           age2 |  -.0565551   .0087676    -6.45   0.000     -.073846   -.0392642
         female |   .1058013   .0164944     6.41   0.000     .0732721    .1383305
     father_jhs |   -.015877   .0141719    -1.12   0.264     -.043826    .0120721
     mother_jhs |  -.0103795    .016759    -0.62   0.536    -.0434306    .0226715
           ses1 |  -.0028992    .008982    -0.32   0.747     -.020613    .0148146
     class_size |   .0014578   .0008679     1.68   0.095    -.0002539    .0031695
       t_female |   .0274144   .0269058     1.02   0.310    -.0256476    .0804764
         t_age2 |  -.0017104   .0065518    -0.26   0.794    -.0146314    .0112106
          t_exp |  -.0045926   .0064469    -0.71   0.477    -.0173067    .0081215
      t_4yrcoll |  -.0394856   .0511738    -0.77   0.441    -.1404076    .0614364
         t_cert |   .0624483   .0739009     0.85   0.399    -.0832947    .2081914
   t_major_math |  -.0526827   .0316837    -1.66   0.098    -.1151675     .009802
   t_rank_yigao |   .0998114   .0411134     2.43   0.016     .0187301    .1808928
                |
        blockZZ |
            12  |  -.0262973   .0577041    -0.46   0.649    -.1400979    .0875032
            21  |  -.0715356   .0700945    -1.02   0.309    -.2097718    .0667006
            22  |  -.0050057   .0511307    -0.10   0.922    -.1058428    .0958313
            31  |   .0494679   .0714968     0.69   0.490     -.091534    .1904697
            32  |   .0577515   .0461743     1.25   0.213    -.0333108    .1488137
            41  |  -.0831108   .0640926    -1.30   0.196    -.2095104    .0432888
            42  |  -.1295574   .0637279    -2.03   0.043    -.2552379   -.0038769
            51  |  -.0282955   .0619706    -0.46   0.648    -.1505102    .0939193
            52  |  -.0507368   .0567187    -0.89   0.372     -.162594    .0611204
            61  |   .0510796   .0808092     0.63   0.528    -.1082876    .2104468
            62  |  -.0264153   .0570448    -0.46   0.644    -.1389156     .086085
                |
          _cons |   .7026035   .2214188     3.17   0.002     .2659343    1.139273
---------------------------------------------------------------------------------
option se() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. /* Compare in-person (in NTTP only or NTTP + follow-up) VERSUS no-in-person (in NTTP only or NTTP + follow-up) */
. foreach var of varlist $mainoutcomes {
  2.     regress `var' i.in_person z_baseline i.blockZZ if treatment != 0 & spillover == 0, vce(cluster schid)
  3.     estimates store model1
  4. 
.     regress `var' i.in_person $covariates i.blockZZ if treatment != 0 & spillover == 0, vce(cluster schid)
  5.     estimates store model2
  6. 
.     /* Save the regression results in separate models and then create the table */
.     eststo clear
  7.     eststo model1
  8.     eststo model2
  9.     esttab, ///
>     cells("b(fmt(%9.3f)) se(fmt(%9.3f))") label unstack noobs ///
>     mlabels("PD" "PD + Follow-up") ///
>     stats(coef se) replace
 10.     
.     /* Repeat the process for different comparisons */
. }

Linear regression                                      Number of obs =   10725
                                                       F( 13,   198) =  540.73
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5660
                                                       Root MSE      =  .65495

                                   (Std. Err. adjusted for 199 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0080316   .0287632     0.28   0.780    -.0486899    .0647531
     z_baseline |   .7607173   .0093798    81.10   0.000     .7422203    .7792144
                |
        blockZZ |
            12  |  -.0209904   .0638102    -0.33   0.743    -.1468252    .1048445
            21  |  -.1410433   .0732823    -1.92   0.056    -.2855573    .0034708
            22  |  -.0595902   .0484696    -1.23   0.220    -.1551732    .0359928
            31  |  -.0687972   .0731983    -0.94   0.348    -.2131455    .0755511
            32  |  -.0496542   .0490587    -1.01   0.313    -.1463989    .0470904
            41  |  -.0901764    .063811    -1.41   0.159    -.2160128      .03566
            42  |  -.1415247   .0650239    -2.18   0.031     -.269753   -.0132964
            51  |  -.0650167   .0594636    -1.09   0.276      -.18228    .0522465
            52  |  -.1082785   .0571112    -1.90   0.059    -.2209029    .0043458
            61  |  -.0500655   .0844745    -0.59   0.554    -.2166507    .1165196
            62  |  -.1216238   .0557935    -2.18   0.030    -.2316496    -.011598
                |
          _cons |   .0542808   .0417693     1.30   0.195    -.0280891    .1366507
---------------------------------------------------------------------------------

Linear regression                                      Number of obs =   10483
                                                       F( 25,   196) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5752
                                                       Root MSE      =  .64825

                                   (Std. Err. adjusted for 197 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0054076   .0283579     0.19   0.849    -.0505181    .0613332
     z_baseline |   .7376076   .0104105    70.85   0.000     .7170767    .7581386
           age2 |  -.0565551   .0087676    -6.45   0.000     -.073846   -.0392642
         female |   .1058013   .0164944     6.41   0.000     .0732721    .1383305
     father_jhs |   -.015877   .0141719    -1.12   0.264     -.043826    .0120721
     mother_jhs |  -.0103795    .016759    -0.62   0.536    -.0434306    .0226715
           ses1 |  -.0028992    .008982    -0.32   0.747     -.020613    .0148146
     class_size |   .0014578   .0008679     1.68   0.095    -.0002539    .0031695
       t_female |   .0274144   .0269058     1.02   0.310    -.0256476    .0804764
         t_age2 |  -.0017104   .0065518    -0.26   0.794    -.0146314    .0112106
          t_exp |  -.0045926   .0064469    -0.71   0.477    -.0173067    .0081215
      t_4yrcoll |  -.0394856   .0511738    -0.77   0.441    -.1404076    .0614364
         t_cert |   .0624483   .0739009     0.85   0.399    -.0832947    .2081914
   t_major_math |  -.0526827   .0316837    -1.66   0.098    -.1151675     .009802
   t_rank_yigao |   .0998114   .0411134     2.43   0.016     .0187301    .1808928
                |
        blockZZ |
            12  |  -.0262973   .0577041    -0.46   0.649    -.1400979    .0875032
            21  |  -.0715356   .0700945    -1.02   0.309    -.2097718    .0667006
            22  |  -.0050057   .0511307    -0.10   0.922    -.1058428    .0958313
            31  |   .0494679   .0714968     0.69   0.490     -.091534    .1904697
            32  |   .0577515   .0461743     1.25   0.213    -.0333108    .1488137
            41  |  -.0831108   .0640926    -1.30   0.196    -.2095104    .0432888
            42  |  -.1295574   .0637279    -2.03   0.043    -.2552379   -.0038769
            51  |  -.0282955   .0619706    -0.46   0.648    -.1505102    .0939193
            52  |  -.0507368   .0567187    -0.89   0.372     -.162594    .0611204
            61  |   .0510796   .0808092     0.63   0.528    -.1082876    .2104468
            62  |  -.0264153   .0570448    -0.46   0.644    -.1389156     .086085
                |
          _cons |   .7026035   .2214188     3.17   0.002     .2659343    1.139273
---------------------------------------------------------------------------------

------------------------------------------------------------------------
                              (1)                       (2)             
                               PD              PD + Follo~p             
                                b           se            b           se
------------------------------------------------------------------------
in_person_sch=0             0.000            .        0.000            .
in_person_sch=1             0.005        0.028        0.005        0.028
z_baseline                  0.738        0.010        0.738        0.010
age2                       -0.057        0.009       -0.057        0.009
female                      0.106        0.016        0.106        0.016
father_jhs                 -0.016        0.014       -0.016        0.014
mother_jhs                 -0.010        0.017       -0.010        0.017
ses1                       -0.003        0.009       -0.003        0.009
class_size                  0.001        0.001        0.001        0.001
t_female                    0.027        0.027        0.027        0.027
t_age2                     -0.002        0.007       -0.002        0.007
t_exp                      -0.005        0.006       -0.005        0.006
t_4yrcoll                  -0.039        0.051       -0.039        0.051
t_cert                      0.062        0.074        0.062        0.074
t_major_math               -0.053        0.032       -0.053        0.032
t_rank_yigao                0.100        0.041        0.100        0.041
blockZZ=11                  0.000            .        0.000            .
blockZZ=12                 -0.026        0.058       -0.026        0.058
blockZZ=21                 -0.072        0.070       -0.072        0.070
blockZZ=22                 -0.005        0.051       -0.005        0.051
blockZZ=31                  0.049        0.071        0.049        0.071
blockZZ=32                  0.058        0.046        0.058        0.046
blockZZ=41                 -0.083        0.064       -0.083        0.064
blockZZ=42                 -0.130        0.064       -0.130        0.064
blockZZ=51                 -0.028        0.062       -0.028        0.062
blockZZ=52                 -0.051        0.057       -0.051        0.057
blockZZ=61                  0.051        0.081        0.051        0.081
blockZZ=62                 -0.026        0.057       -0.026        0.057
Constant                    0.703        0.221        0.703        0.221
------------------------------------------------------------------------
coef                                                                    
se                                                                      
------------------------------------------------------------------------

Linear regression                                      Number of obs =    9934
                                                       F( 13,   197) =  344.04
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4993
                                                       Root MSE      =  .69872

                                   (Std. Err. adjusted for 198 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0432258   .0366789     1.18   0.240    -.0291079    .1155595
     z_baseline |   .7230623    .011139    64.91   0.000     .7010954    .7450293
                |
        blockZZ |
            12  |  -.0613931    .089838    -0.68   0.495    -.2385607    .1157745
            21  |  -.1511623   .1003068    -1.51   0.133    -.3489752    .0466506
            22  |  -.0490742    .078907    -0.62   0.535     -.204685    .1065366
            31  |  -.1181125   .0989392    -1.19   0.234    -.3132285    .0770035
            32  |  -.0736917   .1155968    -0.64   0.525    -.3016578    .1542743
            41  |  -.0518849   .0817023    -0.64   0.526    -.2130084    .1092386
            42  |  -.0887887   .0880339    -1.01   0.314    -.2623985     .084821
            51  |  -.1343938    .082563    -1.63   0.105    -.2972146     .028427
            52  |  -.0844158    .089895    -0.94   0.349    -.2616959    .0928643
            61  |  -.0358581   .0956146    -0.38   0.708    -.2244176    .1527014
            62  |  -.1532741   .0877053    -1.75   0.082    -.3262359    .0196877
                |
          _cons |   .0054921    .069586     0.08   0.937     -.131737    .1427213
---------------------------------------------------------------------------------

Linear regression                                      Number of obs =    9726
                                                       F( 25,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5166
                                                       Root MSE      =  .68659

                                   (Std. Err. adjusted for 196 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0305453   .0344275     0.89   0.376    -.0373527    .0984432
     z_baseline |   .6916197   .0121284    57.02   0.000     .6676999    .7155395
           age2 |  -.0675444   .0101539    -6.65   0.000      -.08757   -.0475188
         female |   .1294822    .017757     7.29   0.000     .0944618    .1645026
     father_jhs |  -.0162329   .0145644    -1.11   0.266    -.0449569    .0124911
     mother_jhs |   .0159282   .0174438     0.91   0.362    -.0184745    .0503309
           ses1 |   .0059419   .0093093     0.64   0.524    -.0124179    .0243018
     class_size |   .0026931   .0010709     2.51   0.013      .000581    .0048051
       t_female |   .0511654   .0359212     1.42   0.156    -.0196785    .1220094
         t_age2 |  -.0041422   .0088337    -0.47   0.640     -.021564    .0132797
          t_exp |  -.0085729   .0081546    -1.05   0.294    -.0246555    .0075097
      t_4yrcoll |  -.1925086   .0546964    -3.52   0.001    -.3003811   -.0846362
         t_cert |   .1984692   .0885702     2.24   0.026     .0237907    .3731476
   t_major_math |  -.0186993   .0356635    -0.52   0.601    -.0890349    .0516363
   t_rank_yigao |   .1495569   .0472916     3.16   0.002     .0562881    .2428257
                |
        blockZZ |
            12  |  -.0785359   .0733825    -1.07   0.286    -.2232612    .0661893
            21  |  -.0337233   .0950129    -0.35   0.723    -.2211081    .1536616
            22  |   .0267809   .0741828     0.36   0.718    -.1195226    .1730845
            31  |   .0317211   .0959094     0.33   0.741    -.1574319     .220874
            32  |   .0273769    .116156     0.24   0.814    -.2017065    .2564603
            41  |   .0034133   .0799942     0.04   0.966    -.1543517    .1611782
            42  |  -.0578137   .0782236    -0.74   0.461    -.2120867    .0964593
            51  |  -.1129113   .0745459    -1.51   0.131    -.2599311    .0341085
            52  |  -.0360823   .0855172    -0.42   0.674    -.2047398    .1325752
            61  |    .065533   .0848442     0.77   0.441    -.1017971    .2328631
            62  |  -.0460662   .0764084    -0.60   0.547    -.1967592    .1046268
                |
          _cons |   .7084308   .2822394     2.51   0.013     .1517971    1.265065
---------------------------------------------------------------------------------

------------------------------------------------------------------------
                              (1)                       (2)             
                               PD              PD + Follo~p             
                                b           se            b           se
------------------------------------------------------------------------
in_person_sch=0             0.000            .        0.000            .
in_person_sch=1             0.031        0.034        0.031        0.034
z_baseline                  0.692        0.012        0.692        0.012
age2                       -0.068        0.010       -0.068        0.010
female                      0.129        0.018        0.129        0.018
father_jhs                 -0.016        0.015       -0.016        0.015
mother_jhs                  0.016        0.017        0.016        0.017
ses1                        0.006        0.009        0.006        0.009
class_size                  0.003        0.001        0.003        0.001
t_female                    0.051        0.036        0.051        0.036
t_age2                     -0.004        0.009       -0.004        0.009
t_exp                      -0.009        0.008       -0.009        0.008
t_4yrcoll                  -0.193        0.055       -0.193        0.055
t_cert                      0.198        0.089        0.198        0.089
t_major_math               -0.019        0.036       -0.019        0.036
t_rank_yigao                0.150        0.047        0.150        0.047
blockZZ=11                  0.000            .        0.000            .
blockZZ=12                 -0.079        0.073       -0.079        0.073
blockZZ=21                 -0.034        0.095       -0.034        0.095
blockZZ=22                  0.027        0.074        0.027        0.074
blockZZ=31                  0.032        0.096        0.032        0.096
blockZZ=32                  0.027        0.116        0.027        0.116
blockZZ=41                  0.003        0.080        0.003        0.080
blockZZ=42                 -0.058        0.078       -0.058        0.078
blockZZ=51                 -0.113        0.075       -0.113        0.075
blockZZ=52                 -0.036        0.086       -0.036        0.086
blockZZ=61                  0.066        0.085        0.066        0.085
blockZZ=62                 -0.046        0.076       -0.046        0.076
Constant                    0.708        0.282        0.708        0.282
------------------------------------------------------------------------
coef                                                                    
se                                                                      
------------------------------------------------------------------------

. 
. /* Compare in-person with control */
. foreach var of varlist $mainoutcomes {
  2.     regress `var' i.in_person z_baseline i.blockZ if spillover == 0 & ((treatment == 1 & in_person == 1) | (treatment == 2 & in_person == 1) | treatment == 0), v
> ce(cluster schid)
  3.     estimates store model3
  4. 
.     regress `var' i.in_person $covariates i.blockZ if spillover == 0 & ((treatment == 1 & in_person == 1) | (treatment == 2 & in_person == 1) | treatment == 0), vce
> (cluster schid)
  5.     estimates store model4
  6. 
.     /* Save the regression results in separate models and then create the table */
.     eststo clear
  7.     eststo model3
  8.     eststo model4
  9.     esttab, ///
>     cells("b(fmt(%9.3f)) se(fmt(%9.3f))") label unstack noobs ///
>     mlabels("PD" "PD + Follow-up") ///
>     stats(coef se) replace
 10.     
.     /* Repeat the process for different comparisons */
. }

Linear regression                                      Number of obs =   10967
                                                       F(  7,   202) =  749.29
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5443
                                                       Root MSE      =  .66812

                                   (Std. Err. adjusted for 203 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |  -.0030113   .0284127    -0.11   0.916    -.0590349    .0530122
     z_baseline |    .737901   .0103016    71.63   0.000     .7175886    .7582135
                |
         blockZ |
            18  |  -.0606078   .0395619    -1.53   0.127     -.138615    .0173994
            19  |  -.0845743   .0615527    -1.37   0.171    -.2059425     .036794
            27  |  -.0818675   .0430114    -1.90   0.058    -.1666764    .0029414
            28  |  -.0396721   .0417116    -0.95   0.343     -.121918    .0425738
            29  |  -.0308503   .0540218    -0.57   0.569    -.1373692    .0756686
                |
          _cons |    .042501   .0325515     1.31   0.193    -.0216833    .1066852
---------------------------------------------------------------------------------

Linear regression                                      Number of obs =   10774
                                                       F( 19,   201) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5543
                                                       Root MSE      =  .66062

                                   (Std. Err. adjusted for 202 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_midline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |  -.0222717   .0278121    -0.80   0.424    -.0771126    .0325691
     z_baseline |   .7137214   .0107063    66.66   0.000     .6926103    .7348325
           age2 |   -.064774   .0086547    -7.48   0.000    -.0818396   -.0477083
         female |   .1193432   .0175197     6.81   0.000     .0847972    .1538892
     father_jhs |  -.0130923   .0151744    -0.86   0.389    -.0430138    .0168292
     mother_jhs |   .0008559   .0165853     0.05   0.959    -.0318477    .0335594
           ses1 |  -.0116072   .0083698    -1.39   0.167    -.0281111    .0048966
     class_size |   .0020153   .0009333     2.16   0.032     .0001749    .0038557
       t_female |   .0446875    .028803     1.55   0.122    -.0121073    .1014822
         t_age2 |  -.0108014   .0093747    -1.15   0.251    -.0292869    .0076841
          t_exp |   .0051589   .0080529     0.64   0.522    -.0107201     .021038
      t_4yrcoll |   .0386577   .0377514     1.02   0.307    -.0357819    .1130973
         t_cert |  -.1486352   .0422478    -3.52   0.001    -.2319409   -.0653295
   t_major_math |  -.0134814   .0294695    -0.46   0.648    -.0715904    .0446275
   t_rank_yigao |   .0795145   .0396777     2.00   0.046     .0012765    .1577525
                |
         blockZ |
            18  |   .0210407   .0403176     0.52   0.602     -.058459    .1005404
            19  |   .0743105   .0593443     1.25   0.212    -.0427068    .1913278
            27  |  -.0641348   .0433771    -1.48   0.141    -.1496673    .0213977
            28  |    .041375    .043692     0.95   0.345    -.0447785    .1275286
            29  |   .1167636   .0569197     2.05   0.042     .0045273    .2289999
                |
          _cons |   1.111422   .2844272     3.91   0.000     .5505781    1.672266
---------------------------------------------------------------------------------

------------------------------------------------------------------------
                              (1)                       (2)             
                               PD              PD + Follo~p             
                                b           se            b           se
------------------------------------------------------------------------
in_person_sch=0             0.000            .        0.000            .
in_person_sch=1            -0.022        0.028       -0.022        0.028
z_baseline                  0.714        0.011        0.714        0.011
age2                       -0.065        0.009       -0.065        0.009
female                      0.119        0.018        0.119        0.018
father_jhs                 -0.013        0.015       -0.013        0.015
mother_jhs                  0.001        0.017        0.001        0.017
ses1                       -0.012        0.008       -0.012        0.008
class_size                  0.002        0.001        0.002        0.001
t_female                    0.045        0.029        0.045        0.029
t_age2                     -0.011        0.009       -0.011        0.009
t_exp                       0.005        0.008        0.005        0.008
t_4yrcoll                   0.039        0.038        0.039        0.038
t_cert                     -0.149        0.042       -0.149        0.042
t_major_math               -0.013        0.029       -0.013        0.029
t_rank_yigao                0.080        0.040        0.080        0.040
17                          0.000            .        0.000            .
18                          0.021        0.040        0.021        0.040
19                          0.074        0.059        0.074        0.059
27                         -0.064        0.043       -0.064        0.043
28                          0.041        0.044        0.041        0.044
29                          0.117        0.057        0.117        0.057
Constant                    1.111        0.284        1.111        0.284
------------------------------------------------------------------------
coef                                                                    
se                                                                      
------------------------------------------------------------------------

Linear regression                                      Number of obs =   10168
                                                       F(  7,   201) =  757.87
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4933
                                                       Root MSE      =  .70931

                                   (Std. Err. adjusted for 202 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |   .0441813   .0350736     1.26   0.209    -.0249781    .1133406
     z_baseline |   .7209559   .0102993    70.00   0.000     .7006473    .7412644
                |
         blockZ |
            18  |  -.0196567   .0500846    -0.39   0.695    -.1184154     .079102
            19  |  -.1199732   .0618475    -1.94   0.054    -.2419263      .00198
            27  |  -.0072915   .0623814    -0.12   0.907    -.1302975    .1157144
            28  |  -.0170968    .053247    -0.32   0.748    -.1220911    .0878976
            29  |   .0205408   .0612553     0.34   0.738    -.1002446    .1413262
                |
          _cons |  -.0518017   .0411885    -1.26   0.210    -.1330186    .0294152
---------------------------------------------------------------------------------

Linear regression                                      Number of obs =   10006
                                                       F( 19,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5066
                                                       Root MSE      =  .69977

                                   (Std. Err. adjusted for 201 clusters in schid)
---------------------------------------------------------------------------------
                |               Robust
      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
1.in_person_sch |    .010695   .0316032     0.34   0.735    -.0516232    .0730133
     z_baseline |   .6898746   .0105418    65.44   0.000     .6690873    .7106619
           age2 |  -.0702849   .0101387    -6.93   0.000    -.0902773   -.0502924
         female |   .1510757   .0186418     8.10   0.000      .114316    .1878354
     father_jhs |   .0029501   .0157033     0.19   0.851    -.0280152    .0339154
     mother_jhs |  -.0226649   .0155978    -1.45   0.148    -.0534222    .0080924
           ses1 |   .0109007   .0087247     1.25   0.213    -.0063035    .0281048
     class_size |   .0039355   .0012071     3.26   0.001     .0015552    .0063158
       t_female |   .0545114     .03769     1.45   0.150    -.0198094    .1288322
         t_age2 |  -.0019063   .0093563    -0.20   0.839    -.0203559    .0165434
          t_exp |  -.0025995   .0090343    -0.29   0.774    -.0204142    .0152152
      t_4yrcoll |  -.0005046   .0481031    -0.01   0.992    -.0953589    .0943496
         t_cert |  -.0404833    .051404    -0.79   0.432    -.1418468    .0608801
   t_major_math |  -.0056737   .0386278    -0.15   0.883    -.0818436    .0704963
   t_rank_yigao |   .1050746   .0492062     2.14   0.034     .0080451     .202104
                |
         blockZ |
            18  |   .0762601   .0468265     1.63   0.105    -.0160769    .1685972
            19  |   .0426164   .0608881     0.70   0.485    -.0774485    .1626814
            27  |   .0171855   .0672855     0.26   0.799    -.1154944    .1498655
            28  |   .0604083   .0532538     1.13   0.258    -.0446026    .1654192
            29  |   .1746414   .0606421     2.88   0.004     .0550615    .2942213
                |
          _cons |   .6396173   .2823669     2.27   0.025     .0828191    1.196415
---------------------------------------------------------------------------------

------------------------------------------------------------------------
                              (1)                       (2)             
                               PD              PD + Follo~p             
                                b           se            b           se
------------------------------------------------------------------------
in_person_sch=0             0.000            .        0.000            .
in_person_sch=1             0.011        0.032        0.011        0.032
z_baseline                  0.690        0.011        0.690        0.011
age2                       -0.070        0.010       -0.070        0.010
female                      0.151        0.019        0.151        0.019
father_jhs                  0.003        0.016        0.003        0.016
mother_jhs                 -0.023        0.016       -0.023        0.016
ses1                        0.011        0.009        0.011        0.009
class_size                  0.004        0.001        0.004        0.001
t_female                    0.055        0.038        0.055        0.038
t_age2                     -0.002        0.009       -0.002        0.009
t_exp                      -0.003        0.009       -0.003        0.009
t_4yrcoll                  -0.001        0.048       -0.001        0.048
t_cert                     -0.040        0.051       -0.040        0.051
t_major_math               -0.006        0.039       -0.006        0.039
t_rank_yigao                0.105        0.049        0.105        0.049
17                          0.000            .        0.000            .
18                          0.076        0.047        0.076        0.047
19                          0.043        0.061        0.043        0.061
27                          0.017        0.067        0.017        0.067
28                          0.060        0.053        0.060        0.053
29                          0.175        0.061        0.175        0.061
Constant                    0.640        0.282        0.640        0.282
------------------------------------------------------------------------
coef                                                                    
se                                                                      
------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. foreach het of varlist ses_base_terc math_base_terc t_training_hours_terc t_female t_4yrcoll t_major_math {
  2.         /*compare GUOPEI (treatment == 2) with GUOPEI + FOLLOW-UP (treatment == 1) with CONTROL */
.         foreach var of varlist z_endline {
  3.                 regress `var' i.treatment##i.`het' $covariates i.blockZ if spillover == 0, vce(cluster schid)
  4.                 outreg2 using "3ie_guopei_control_stu_zscore_`het'.xls", dec(3) excel append            
  5.         }
  6. 
.         /*compare in-person (in NTTP only or NTTP + follow-up) VERSUS no-in-person (in NTTP only or NTTP + follow-up)*/
.         foreach var of varlist z_endline {
  7.                 regress `var' i.in_person##i.`het' $covariates i.blockZZ if treatment!= 0 & spillover == 0, vce(cluster schid)
  8.                 outreg2 using "3ie_inpersonYN_stu_zscore_`het'.xls", dec(3) excel append
  9.         }
 10. 
.         /*compare in-person with control*/
.         foreach var of varlist z_endline {
 11.                 regress `var' i.in_person##i.`het' $covariates i.blockZ if spillover == 0 & ((treatment == 1 & in_person == 1) | (treatment == 2 & in_person == 1
> ) | treatment == 0), vce(cluster schid)
 12.                 outreg2 using "3ie_inpersonY_control_stu_zscore_`het'.xls", dec(3) excel append
 13.         }
 14. }

Linear regression                                      Number of obs =   14599
                                                       F( 27,   295) =  275.62
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5045
                                                       Root MSE      =   .7019

                                           (Std. Err. adjusted for 296 clusters in schid)
-----------------------------------------------------------------------------------------
                        |               Robust
              z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
              treatment |
                     1  |   .0104795   .0432758     0.24   0.809    -.0746889    .0956479
                     2  |     .03501   .0451227     0.78   0.438    -.0537931    .1238131
                        |
          ses_base_terc |
                     2  |   .0100345   .0332301     0.30   0.763    -.0553637    .0754326
                     3  |   .0034429   .0451339     0.08   0.939    -.0853824    .0922682
                        |
treatment#ses_base_terc |
                   1 2  |   .0093212   .0411451     0.23   0.821    -.0716538    .0902963
                   1 3  |  -.0295915   .0490295    -0.60   0.547    -.1260834    .0669003
                   2 2  |  -.0623949   .0424621    -1.47   0.143    -.1459619    .0211722
                   2 3  |  -.0705138   .0498336    -1.41   0.158    -.1685882    .0275607
                        |
             z_baseline |   .6903169   .0094537    73.02   0.000     .6717116    .7089221
                   age2 |  -.0681884   .0085022    -8.02   0.000    -.0849209   -.0514558
                 female |   .1400854   .0151114     9.27   0.000     .1103456    .1698252
             father_jhs |  -.0014141   .0126815    -0.11   0.911    -.0263717    .0235436
             mother_jhs |  -.0054412   .0143993    -0.38   0.706    -.0337795    .0228971
                   ses1 |   .0190168   .0143063     1.33   0.185    -.0091386    .0471721
             class_size |     .00365   .0009761     3.74   0.000     .0017289     .005571
               t_female |   .0599311   .0309644     1.94   0.054     -.001008    .1208702
                 t_age2 |  -.0065247   .0074571    -0.87   0.382    -.0212005    .0081512
                  t_exp |   .0009201   .0071575     0.13   0.898    -.0131661    .0150063
              t_4yrcoll |  -.0270779   .0442184    -0.61   0.541    -.1141013    .0599456
                 t_cert |  -.0206526   .0548941    -0.38   0.707    -.1286862     .087381
           t_major_math |  -.0012587   .0324606    -0.04   0.969    -.0651424    .0626251
           t_rank_yigao |    .120704   .0403569     2.99   0.003     .0412801     .200128
                        |
                 blockZ |
                    18  |   .0148034   .0444275     0.33   0.739    -.0726317    .1022385
                    19  |   .0234121    .057359     0.41   0.683    -.0894727    .1362968
                    27  |  -.0143779   .0521661    -0.28   0.783    -.1170429     .088287
                    28  |   .0119674   .0463744     0.26   0.797    -.0792992     .103234
                    29  |   .0832432   .0522346     1.59   0.112    -.0195565    .1860428
                        |
                  _cons |   .7513761   .2318224     3.24   0.001     .2951408    1.207611
-----------------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore_ses_base_terc.xls
dir : seeout

Linear regression                                      Number of obs =    9726
                                                       F( 29,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5169
                                                       Root MSE      =  .68656

                                               (Std. Err. adjusted for 196 clusters in schid)
---------------------------------------------------------------------------------------------
                            |               Robust
                  z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
            1.in_person_sch |   .0374472   .0442815     0.85   0.399    -.0498849    .1247792
                            |
              ses_base_terc |
                         2  |  -.0049512   .0343966    -0.14   0.886    -.0727884     .062886
                         3  |  -.0709599   .0520906    -1.36   0.175    -.1736932    .0317734
                            |
in_person_sch#ses_base_terc |
                       1 2  |  -.0365717   .0394496    -0.93   0.355    -.1143745     .041231
                       1 3  |   .0190116    .047873     0.40   0.692    -.0754037     .113427
                            |
                 z_baseline |   .6916398   .0121087    57.12   0.000     .6677589    .7155206
                       age2 |  -.0669588   .0101229    -6.61   0.000    -.0869231   -.0469945
                     female |   .1292394   .0177493     7.28   0.000     .0942342    .1642447
                 father_jhs |  -.0160421     .01454    -1.10   0.271    -.0447179    .0126337
                 mother_jhs |   .0155635   .0173875     0.90   0.372    -.0187283    .0498553
                       ses1 |   .0264164   .0170837     1.55   0.124    -.0072761     .060109
                 class_size |   .0027015   .0010749     2.51   0.013     .0005817    .0048214
                   t_female |   .0505385   .0358036     1.41   0.160    -.0200735    .1211505
                     t_age2 |  -.0045544   .0088417    -0.52   0.607     -.021992    .0128832
                      t_exp |  -.0082745   .0081876    -1.01   0.313    -.0244221    .0078732
                  t_4yrcoll |  -.1925515    .054849    -3.51   0.001     -.300725   -.0843781
                     t_cert |    .196259   .0892598     2.20   0.029     .0202206    .3722975
               t_major_math |   -.018779   .0355219    -0.53   0.598    -.0888354    .0512773
               t_rank_yigao |   .1488972   .0473912     3.14   0.002      .055432    .2423623
                            |
                    blockZZ |
                        12  |  -.0776279   .0733529    -1.06   0.291    -.2222948    .0670391
                        21  |  -.0330098   .0947131    -0.35   0.728    -.2198034    .1537839
                        22  |   .0269644    .074176     0.36   0.717    -.1193257    .1732546
                        31  |   .0313732    .095303     0.33   0.742    -.1565838    .2193302
                        32  |   .0261798   .1162616     0.23   0.822    -.2031118    .2554714
                        41  |   .0036617   .0795657     0.05   0.963     -.153258    .1605814
                        42  |  -.0569409   .0778196    -0.73   0.465    -.2104171    .0965353
                        51  |  -.1128404   .0743593    -1.52   0.131    -.2594921    .0338114
                        52  |  -.0359157   .0853274    -0.42   0.674    -.2041988    .1323674
                        61  |   .0660382     .08458     0.78   0.436    -.1007708    .2328472
                        62  |  -.0459035   .0757926    -0.61   0.545     -.195382    .1035749
                            |
                      _cons |   .7364245   .2815945     2.62   0.010     .1810627    1.291786
---------------------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_ses_base_terc.xls
dir : seeout

Linear regression                                      Number of obs =   10006
                                                       F( 23,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5067
                                                       Root MSE      =  .69982

                                               (Std. Err. adjusted for 201 clusters in schid)
---------------------------------------------------------------------------------------------
                            |               Robust
                  z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
            1.in_person_sch |   .0342159   .0402909     0.85   0.397    -.0452335    .1136653
                            |
              ses_base_terc |
                         2  |   .0004277    .034192     0.01   0.990    -.0669954    .0678509
                         3  |  -.0151711   .0478071    -0.32   0.751    -.1094418    .0790996
                            |
in_person_sch#ses_base_terc |
                       1 2  |  -.0421534   .0395143    -1.07   0.287    -.1200715    .0357647
                       1 3  |  -.0328308   .0462575    -0.71   0.479    -.1240457    .0583841
                            |
                 z_baseline |   .6897954   .0105375    65.46   0.000     .6690165    .7105743
                       age2 |  -.0701914   .0102122    -6.87   0.000    -.0903288   -.0500539
                     female |   .1510601   .0186171     8.11   0.000      .114349    .1877712
                 father_jhs |   .0031888   .0156741     0.20   0.839    -.0277189    .0340964
                 mother_jhs |    -.02343   .0156211    -1.50   0.135    -.0542333    .0073732
                       ses1 |   .0219086   .0167659     1.31   0.193     -.011152    .0549692
                 class_size |   .0039382    .001209     3.26   0.001     .0015543    .0063222
                   t_female |   .0546946   .0375715     1.46   0.147    -.0193924    .1287817
                     t_age2 |  -.0017242   .0093677    -0.18   0.854    -.0201964    .0167479
                      t_exp |  -.0027332     .00907    -0.30   0.763    -.0206184    .0151519
                  t_4yrcoll |  -.0006438   .0484723    -0.01   0.989    -.0962261    .0949385
                     t_cert |   -.036246   .0509865    -0.71   0.478    -.1367861    .0642942
               t_major_math |  -.0050566   .0385346    -0.13   0.896    -.0810427    .0709296
               t_rank_yigao |   .1057197   .0492055     2.15   0.033     .0086917    .2027478
                            |
                     blockZ |
                        18  |   .0755476   .0468183     1.61   0.108    -.0167733    .1678685
                        19  |   .0419898   .0607812     0.69   0.490    -.0778644     .161844
                        27  |    .017745   .0671828     0.26   0.792    -.1147325    .1502224
                        28  |   .0602676   .0533013     1.13   0.260    -.0448369    .1653722
                        29  |   .1732044   .0602378     2.88   0.004     .0544216    .2919871
                            |
                      _cons |   .6339646   .2811504     2.25   0.025     .0795652    1.188364
---------------------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_ses_base_terc.xls
dir : seeout

Linear regression                                      Number of obs =   14599
                                                       F( 27,   295) =  283.53
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5051
                                                       Root MSE      =  .70146

                                            (Std. Err. adjusted for 296 clusters in schid)
------------------------------------------------------------------------------------------
                         |               Robust
               z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------+----------------------------------------------------------------
               treatment |
                      1  |  -.0264514   .0478946    -0.55   0.581    -.1207098     .067807
                      2  |  -.0186635   .0457887    -0.41   0.684    -.1087774    .0714504
                         |
          math_base_terc |
                      2  |   .0843154   .0362578     2.33   0.021     .0129588    .1556721
                      3  |   .1317404   .0530382     2.48   0.014     .0273592    .2361216
                         |
treatment#math_base_terc |
                    1 2  |   .0451012    .046005     0.98   0.328    -.0454384    .1356408
                    1 3  |   .0533975   .0557434     0.96   0.339    -.0563077    .1631027
                    2 2  |    .032783   .0437994     0.75   0.455    -.0534159     .118982
                    2 3  |   .0027334   .0543521     0.05   0.960    -.1042337    .1097004
                         |
              z_baseline |   .6312017   .0165135    38.22   0.000     .5987026    .6637008
                    age2 |  -.0678782   .0084974    -7.99   0.000    -.0846014   -.0511549
                  female |   .1409248    .015156     9.30   0.000     .1110971    .1707525
              father_jhs |  -.0007014   .0126235    -0.06   0.956    -.0255449    .0241421
              mother_jhs |  -.0054083   .0144744    -0.37   0.709    -.0338945    .0230778
                    ses1 |   .0090427    .007664     1.18   0.239    -.0060404    .0241258
              class_size |   .0036099   .0009681     3.73   0.000     .0017047    .0055152
                t_female |   .0598182   .0311466     1.92   0.056    -.0014795     .121116
                  t_age2 |  -.0066036   .0074522    -0.89   0.376    -.0212697    .0080626
                   t_exp |   .0010031   .0071152     0.14   0.888    -.0129999     .015006
               t_4yrcoll |  -.0274082   .0437751    -0.63   0.532    -.1135592    .0587429
                  t_cert |  -.0166932   .0586721    -0.28   0.776    -.1321622    .0987757
            t_major_math |  -.0008702   .0326641    -0.03   0.979    -.0651545    .0634141
            t_rank_yigao |   .1187519   .0405779     2.93   0.004      .038893    .1986108
                         |
                  blockZ |
                     18  |   .0152723   .0443146     0.34   0.731    -.0719405     .102485
                     19  |   .0175513   .0572498     0.31   0.759    -.0951185    .1302212
                     27  |  -.0149903   .0522754    -0.29   0.774    -.1178703    .0878896
                     28  |   .0107106   .0461258     0.23   0.817    -.0800667    .1014879
                     29  |   .0759878    .052523     1.45   0.149    -.0273795    .1793551
                         |
                   _cons |   .6850742   .2369345     2.89   0.004     .2187782     1.15137
------------------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore_math_base_terc.xls
dir : seeout

Linear regression                                      Number of obs =    9726
                                                       F( 29,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5175
                                                       Root MSE      =  .68611

                                                (Std. Err. adjusted for 196 clusters in schid)
----------------------------------------------------------------------------------------------
                             |               Robust
                   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             1.in_person_sch |   .0177015   .0495871     0.36   0.721    -.0800944    .1154974
                             |
              math_base_terc |
                          2  |   .1002837   .0400223     2.51   0.013     .0213515     .179216
                          3  |   .1440839   .0591849     2.43   0.016     .0273593    .2608086
                             |
in_person_sch#math_base_terc |
                        1 2  |   .0306812   .0465969     0.66   0.511    -.0612175    .1225798
                        1 3  |   .0053976   .0565882     0.10   0.924    -.1062058     .117001
                             |
                  z_baseline |   .6330958   .0203689    31.08   0.000     .5929242    .6732674
                        age2 |  -.0674966    .010161    -6.64   0.000    -.0875361   -.0474571
                      female |   .1297426   .0178721     7.26   0.000     .0944953      .16499
                  father_jhs |  -.0151791   .0144713    -1.05   0.296    -.0437195    .0133612
                  mother_jhs |   .0154392   .0174083     0.89   0.376    -.0188935    .0497719
                        ses1 |   .0062389   .0092708     0.67   0.502    -.0120451    .0245229
                  class_size |   .0027131   .0010679     2.54   0.012     .0006069    .0048192
                    t_female |   .0516546   .0359162     1.44   0.152    -.0191794    .1224886
                      t_age2 |  -.0040183   .0088215    -0.46   0.649    -.0214162    .0133796
                       t_exp |  -.0085387    .008129    -1.05   0.295    -.0245709    .0074934
                   t_4yrcoll |  -.1915296   .0544823    -3.52   0.001    -.2989797   -.0840795
                      t_cert |   .1959987   .0884499     2.22   0.028     .0215574      .37044
                t_major_math |   -.018717    .035436    -0.53   0.598     -.088604      .05117
                t_rank_yigao |    .148487   .0473772     3.13   0.002     .0550495    .2419245
                             |
                     blockZZ |
                         12  |  -.0782257   .0731346    -1.07   0.286    -.2224622    .0660107
                         21  |    -.03253   .0949068    -0.34   0.732    -.2197057    .1546456
                         22  |   .0246029   .0740007     0.33   0.740    -.1213416    .1705475
                         31  |   .0295189   .0953846     0.31   0.757    -.1585989    .2176368
                         32  |   .0243469   .1155442     0.21   0.833    -.2035299    .2522237
                         41  |   .0049115   .0799917     0.06   0.951    -.1528484    .1626715
                         42  |  -.0578866   .0777652    -0.74   0.458    -.2112554    .0954822
                         51  |  -.1114074    .074201    -1.50   0.135    -.2577469    .0349322
                         52  |  -.0367396   .0854406    -0.43   0.668    -.2052459    .1317668
                         61  |   .0637273   .0851185     0.75   0.455    -.1041438    .2315984
                         62  |  -.0498708   .0762219    -0.65   0.514    -.2001961    .1004544
                             |
                       _cons |   .6274975   .2852979     2.20   0.029     .0648318    1.190163
----------------------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_math_base_terc.xls
dir : seeout

Linear regression                                      Number of obs =   10006
                                                       F( 23,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5072
                                                       Root MSE      =  .69945

                                                (Std. Err. adjusted for 201 clusters in schid)
----------------------------------------------------------------------------------------------
                             |               Robust
                   z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------------+----------------------------------------------------------------
             1.in_person_sch |   -.017093   .0440965    -0.39   0.699    -.1040466    .0698607
                             |
              math_base_terc |
                          2  |   .0633866   .0383439     1.65   0.100    -.0122237    .1389968
                          3  |   .0968353   .0586393     1.65   0.100    -.0187953    .2124659
                             |
in_person_sch#math_base_terc |
                        1 2  |   .0557982   .0430725     1.30   0.197    -.0291364    .1407328
                        1 3  |   .0262986   .0504449     0.52   0.603    -.0731735    .1257708
                             |
                  z_baseline |   .6465767   .0198932    32.50   0.000     .6073493     .685804
                        age2 |   -.070146   .0101626    -6.90   0.000    -.0901855   -.0501065
                      female |   .1508985   .0187173     8.06   0.000     .1139899    .1878071
                  father_jhs |   .0036369    .015633     0.23   0.816    -.0271898    .0344636
                  mother_jhs |  -.0227657   .0156296    -1.46   0.147    -.0535856    .0080542
                        ses1 |   .0110683   .0086877     1.27   0.204     -.006063    .0281996
                  class_size |   .0039242   .0012021     3.26   0.001     .0015538    .0062946
                    t_female |   .0553585   .0377069     1.47   0.144    -.0189957    .1297126
                      t_age2 |  -.0018648    .009363    -0.20   0.842    -.0203276     .016598
                       t_exp |  -.0025805   .0090172    -0.29   0.775    -.0203615    .0152006
                   t_4yrcoll |  -.0008394   .0480608    -0.02   0.986    -.0956102    .0939314
                      t_cert |  -.0373787   .0514371    -0.73   0.468    -.1388072    .0640499
                t_major_math |  -.0051682   .0388945    -0.13   0.894    -.0818642    .0715278
                t_rank_yigao |   .1051443   .0490709     2.14   0.033     .0083815     .201907
                             |
                      blockZ |
                         18  |   .0746879   .0468724     1.59   0.113    -.0177397    .1671154
                         19  |   .0390136   .0607478     0.64   0.521    -.0807748     .158802
                         27  |   .0179021   .0671656     0.27   0.790    -.1145415    .1503456
                         28  |   .0601178   .0530334     1.13   0.258    -.0444584    .1646941
                         29  |   .1700343   .0609131     2.79   0.006     .0499199    .2901487
                             |
                       _cons |   .5834933   .2859651     2.04   0.043     .0195998    1.147387
----------------------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_math_base_terc.xls
dir : seeout

Linear regression                                      Number of obs =   14599
                                                       F( 27,   295) =  277.92
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5056
                                                       Root MSE      =  .70113

                                                   (Std. Err. adjusted for 296 clusters in schid)
-------------------------------------------------------------------------------------------------
                                |               Robust
                      z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------------+----------------------------------------------------------------
                      treatment |
                             1  |   -.040496   .0768046    -0.53   0.598    -.1916503    .1106583
                             2  |  -.0673154   .0733556    -0.92   0.360     -.211682    .0770512
                                |
          t_training_hours_terc |
                             2  |  -.0578891   .0626178    -0.92   0.356    -.1811234    .0653452
                             3  |  -.0621297   .0676917    -0.92   0.359    -.1953494    .0710901
                                |
treatment#t_training_hours_terc |
                           1 2  |   .0067951   .0931526     0.07   0.942    -.1765328    .1901229
                           1 3  |   .1251029   .0964091     1.30   0.195    -.0646338    .3148396
                           2 2  |   .0522225   .0897892     0.58   0.561    -.1244862    .2289311
                           2 3  |   .1335489   .0960254     1.39   0.165    -.0554327    .3225306
                                |
                     z_baseline |   .6890384   .0094138    73.19   0.000     .6705117    .7075651
                           age2 |  -.0704859    .008454    -8.34   0.000    -.0871237   -.0538481
                         female |   .1404157   .0150914     9.30   0.000     .1107153     .170116
                     father_jhs |  -.0016694   .0126845    -0.13   0.895    -.0266329    .0232941
                     mother_jhs |  -.0039669   .0144998    -0.27   0.785    -.0325031    .0245693
                           ses1 |    .010624   .0074381     1.43   0.154    -.0040144    .0252625
                     class_size |   .0038577   .0009471     4.07   0.000     .0019938    .0057215
                       t_female |   .0538328   .0318831     1.69   0.092    -.0089144    .1165801
                         t_age2 |  -.0062176   .0071541    -0.87   0.386    -.0202971     .007862
                          t_exp |   .0002355   .0067367     0.03   0.972    -.0130226    .0134935
                      t_4yrcoll |  -.0330245   .0458271    -0.72   0.472     -.123214     .057165
                         t_cert |  -.0231216   .0453274    -0.51   0.610    -.1123275    .0660844
                   t_major_math |  -.0081062    .030597    -0.26   0.791    -.0683223    .0521099
                   t_rank_yigao |    .124795   .0403577     3.09   0.002     .0453696    .2042204
                                |
                         blockZ |
                            18  |    .011806   .0450395     0.26   0.793    -.0768335    .1004456
                            19  |   .0174776   .0583407     0.30   0.765    -.0973391    .1322944
                            27  |   -.011628   .0525241    -0.22   0.825    -.1149973    .0917414
                            28  |   .0144513    .045316     0.32   0.750    -.0747323    .1036349
                            29  |   .0798047   .0527179     1.51   0.131     -.023946    .1835555
                                |
                          _cons |   .8230507    .229705     3.58   0.000     .3709825    1.275119
-------------------------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore_t_training_hours_terc.xls
dir : seeout

Linear regression                                      Number of obs =    9726
                                                       F( 29,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5184
                                                       Root MSE      =  .68547

                                                       (Std. Err. adjusted for 196 clusters in schid)
-----------------------------------------------------------------------------------------------------
                                    |               Robust
                          z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------------+----------------------------------------------------------------
                    1.in_person_sch |   .0625774   .0666874     0.94   0.349    -.0689438    .1940987
                                    |
              t_training_hours_terc |
                                 2  |  -.0203637   .0653239    -0.31   0.756    -.1491957    .1084683
                                 3  |   .1146165    .067296     1.70   0.090     -.018105    .2473379
                                    |
in_person_sch#t_training_hours_terc |
                               1 2  |     .00583   .0865015     0.07   0.946    -.1647686    .1764286
                               1 3  |  -.0901205   .0908518    -0.99   0.322    -.2692988    .0890578
                                    |
                         z_baseline |   .6914131   .0116304    59.45   0.000     .6684755    .7143508
                               age2 |  -.0701415   .0101106    -6.94   0.000    -.0900816   -.0502013
                             female |   .1300979    .017692     7.35   0.000     .0952057    .1649902
                         father_jhs |  -.0158705   .0142999    -1.11   0.268    -.0440727    .0123318
                         mother_jhs |   .0142772   .0174032     0.82   0.413    -.0200456    .0485999
                               ses1 |   .0081018   .0091383     0.89   0.376    -.0099209    .0261245
                         class_size |   .0028796   .0010707     2.69   0.008      .000768    .0049912
                           t_female |   .0520991   .0367786     1.42   0.158    -.0204358     .124634
                             t_age2 |  -.0040238   .0092693    -0.43   0.665    -.0223046    .0142571
                              t_exp |  -.0077683   .0086565    -0.90   0.371    -.0248407    .0093041
                          t_4yrcoll |  -.1793878   .0552492    -3.25   0.001    -.2883506   -.0704251
                             t_cert |   .1261317   .1007576     1.25   0.212    -.0725828    .3248462
                       t_major_math |  -.0247373   .0362577    -0.68   0.496    -.0962448    .0467703
                       t_rank_yigao |   .1469001   .0475233     3.09   0.002     .0531745    .2406258
                                    |
                            blockZZ |
                                12  |  -.0675877   .0753947    -0.90   0.371    -.2162814    .0811059
                                21  |  -.0475146   .0917968    -0.52   0.605    -.2285565    .1335273
                                22  |   .0440138   .0762358     0.58   0.564    -.1063388    .1943664
                                31  |   .0367997   .0971487     0.38   0.705    -.1547973    .2283968
                                32  |   .0297592   .1153925     0.26   0.797    -.1978184    .2573368
                                41  |   .0131366   .0792059     0.17   0.868    -.1430736    .1693468
                                42  |  -.0498487   .0787865    -0.63   0.528    -.2052318    .1055344
                                51  |  -.0960837   .0778541    -1.23   0.219    -.2496279    .0574604
                                52  |  -.0307367   .0860091    -0.36   0.721    -.2003642    .1388909
                                61  |   .0777261   .0883846     0.88   0.380    -.0965863    .2520384
                                62  |  -.0368685   .0770329    -0.48   0.633    -.1887931    .1150562
                                    |
                              _cons |   .7472302   .2841263     2.63   0.009     .1868752    1.307585
-----------------------------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_t_training_hours_terc.xls
dir : seeout

Linear regression                                      Number of obs =   10006
                                                       F( 23,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5071
                                                       Root MSE      =  .69954

                                                       (Std. Err. adjusted for 201 clusters in schid)
-----------------------------------------------------------------------------------------------------
                                    |               Robust
                          z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------------+----------------------------------------------------------------
                    1.in_person_sch |    -.01167   .0711689    -0.16   0.870    -.1520077    .1286677
                                    |
              t_training_hours_terc |
                                 2  |  -.0478459   .0601099    -0.80   0.427    -.1663764    .0706846
                                 3  |  -.0606909   .0658264    -0.92   0.358    -.1904938    .0691119
                                    |
in_person_sch#t_training_hours_terc |
                               1 2  |   .0077397   .0872409     0.09   0.929    -.1642904    .1797697
                               1 3  |   .0639436   .0917253     0.70   0.487    -.1169292    .2448164
                                    |
                         z_baseline |   .6886145   .0104659    65.80   0.000     .6679768    .7092521
                               age2 |   -.071039   .0101294    -7.01   0.000    -.0910132   -.0510648
                             female |   .1518384   .0186276     8.15   0.000     .1151066    .1885701
                         father_jhs |   .0038843   .0156197     0.25   0.804    -.0269161    .0346846
                         mother_jhs |  -.0209952   .0156592    -1.34   0.182    -.0518734    .0098831
                               ses1 |   .0119586   .0083971     1.42   0.156    -.0045996    .0285168
                         class_size |   .0039614   .0011747     3.37   0.001     .0016451    .0062778
                           t_female |   .0542426   .0396208     1.37   0.173    -.0238854    .1323706
                             t_age2 |  -.0016061   .0088159    -0.18   0.856      -.01899    .0157779
                              t_exp |  -.0032651   .0083661    -0.39   0.697    -.0197622    .0132319
                          t_4yrcoll |  -.0077676   .0499412    -0.16   0.877    -.1062464    .0907113
                             t_cert |  -.0008043   .0604363    -0.01   0.989    -.1199783    .1183698
                       t_major_math |  -.0091476   .0366492    -0.25   0.803     -.081416    .0631208
                       t_rank_yigao |   .1106796   .0478584     2.31   0.022     .0163079    .2050513
                                    |
                             blockZ |
                                18  |   .0757114    .047379     1.60   0.112    -.0177151    .1691378
                                19  |   .0388294   .0603466     0.64   0.521    -.0801678    .1578266
                                27  |   .0148366   .0675029     0.22   0.826    -.1182721    .1479454
                                28  |   .0624646   .0529926     1.18   0.240    -.0420313    .1669605
                                29  |   .1719653   .0601076     2.86   0.005     .0534393    .2904912
                                    |
                              _cons |   .6450938   .2764498     2.33   0.021     .0999634    1.190224
-----------------------------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_t_training_hours_terc.xls
dir : seeout
note: t_female omitted because of collinearity

Linear regression                                      Number of obs =   14599
                                                       F( 23,   295) =  316.78
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5044
                                                       Root MSE      =  .70184

                                      (Std. Err. adjusted for 296 clusters in schid)
------------------------------------------------------------------------------------
                   |               Robust
         z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
         treatment |
                1  |  -.0044588   .0485371    -0.09   0.927    -.0999817    .0910641
                2  |   .0202787   .0492708     0.41   0.681    -.0766881    .1172454
                   |
        1.t_female |   .0707535   .0509971     1.39   0.166    -.0296108    .1711178
                   |
treatment#t_female |
              1 1  |   .0203499   .0703821     0.29   0.773    -.1181649    .1588646
              2 1  |  -.0508215   .0690074    -0.74   0.462    -.1866306    .0849876
                   |
        z_baseline |   .6906989   .0095344    72.44   0.000     .6719348    .7094629
              age2 |   -.067573   .0084054    -8.04   0.000    -.0841151   -.0510309
            female |   .1403512   .0151393     9.27   0.000     .1105566    .1701459
        father_jhs |     -.0012   .0126763    -0.09   0.925    -.0261475    .0237475
        mother_jhs |  -.0050552     .01445    -0.35   0.727    -.0334934    .0233829
              ses1 |   .0090492   .0076781     1.18   0.240    -.0060615      .02416
        class_size |   .0036854   .0009752     3.78   0.000     .0017661    .0056046
          t_female |          0  (omitted)
            t_age2 |  -.0067811   .0074308    -0.91   0.362    -.0214052    .0078431
             t_exp |   .0010304   .0071304     0.14   0.885    -.0130026    .0150633
         t_4yrcoll |  -.0298049   .0443698    -0.67   0.502    -.1171263    .0575164
            t_cert |  -.0275287   .0548414    -0.50   0.616    -.1354586    .0804013
      t_major_math |  -.0017739   .0319807    -0.06   0.956     -.064713    .0611653
      t_rank_yigao |   .1208373   .0405821     2.98   0.003     .0409702    .2007044
                   |
            blockZ |
               18  |   .0163918   .0443581     0.37   0.712    -.0709067    .1036902
               19  |   .0219489   .0568296     0.39   0.700     -.089894    .1337918
               27  |  -.0177358   .0521226    -0.34   0.734     -.120315    .0848435
               28  |   .0127863   .0460094     0.28   0.781    -.0777619    .1033345
               29  |   .0774843   .0523426     1.48   0.140    -.0255278    .1804965
                   |
             _cons |   .7549327   .2288818     3.30   0.001     .3044846    1.205381
------------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore_t_female.xls
dir : seeout
note: t_female omitted because of collinearity

Linear regression                                      Number of obs =    9726
                                                       F( 26,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5166
                                                       Root MSE      =  .68662

                                          (Std. Err. adjusted for 196 clusters in schid)
----------------------------------------------------------------------------------------
                       |               Robust
             z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
       1.in_person_sch |   .0328451   .0511377     0.64   0.521     -.068009    .1336991
            1.t_female |   .0532992    .054638     0.98   0.331     -.054458    .1610565
                       |
in_person_sch#t_female |
                  1 1  |  -.0043709   .0717372    -0.06   0.951    -.1458512    .1371094
                       |
            z_baseline |    .691636   .0120894    57.21   0.000     .6677932    .7154787
                  age2 |  -.0675035   .0101395    -6.66   0.000    -.0875007   -.0475063
                female |   .1295039   .0177339     7.30   0.000      .094529    .1644787
            father_jhs |   -.016197    .014526    -1.12   0.266    -.0448451    .0124512
            mother_jhs |   .0159048   .0174052     0.91   0.362    -.0184218    .0502314
                  ses1 |   .0059478   .0093213     0.64   0.524    -.0124358    .0243313
            class_size |     .00268    .001065     2.52   0.013     .0005796    .0047804
              t_female |          0  (omitted)
                t_age2 |  -.0041354   .0088187    -0.47   0.640    -.0215277     .013257
                 t_exp |  -.0085816   .0081384    -1.05   0.293    -.0246322     .007469
             t_4yrcoll |  -.1923753   .0548687    -3.51   0.001    -.3005877    -.084163
                t_cert |   .1978406   .0907019     2.18   0.030      .018958    .3767232
          t_major_math |  -.0188213    .035652    -0.53   0.598    -.0891342    .0514917
          t_rank_yigao |   .1493753   .0475034     3.14   0.002     .0556888    .2430618
                       |
               blockZZ |
                   12  |  -.0787153   .0731974    -1.08   0.284    -.2230755    .0656449
                   21  |  -.0345512   .0961823    -0.36   0.720    -.2242422    .1551399
                   22  |   .0268643   .0742955     0.36   0.718    -.1196617    .1733902
                   31  |   .0309435   .0946624     0.33   0.744      -.15575     .217637
                   32  |   .0267873   .1176002     0.23   0.820    -.2051442    .2587188
                   41  |   .0030633   .0800529     0.04   0.970    -.1548174     .160944
                   42  |  -.0585237   .0781814    -0.75   0.455    -.2127133    .0956659
                   51  |  -.1131602   .0743995    -1.52   0.130    -.2598912    .0335708
                   52  |  -.0364321   .0855224    -0.43   0.671    -.2050998    .1322355
                   61  |    .065521     .08487     0.77   0.441      -.10186     .232902
                   62  |  -.0464509   .0759374    -0.61   0.541    -.1962149    .1033131
                       |
                 _cons |   .7084137   .2820244     2.51   0.013     .1522041    1.264623
----------------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_t_female.xls
dir : seeout
note: t_female omitted because of collinearity

Linear regression                                      Number of obs =   10006
                                                       F( 20,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5066
                                                       Root MSE      =  .69979

                                          (Std. Err. adjusted for 201 clusters in schid)
----------------------------------------------------------------------------------------
                       |               Robust
             z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
       1.in_person_sch |   .0201063   .0458601     0.44   0.662     -.070325    .1105376
            1.t_female |   .0640141   .0504743     1.27   0.206    -.0355161    .1635442
                       |
in_person_sch#t_female |
                  1 1  |  -.0186353   .0649402    -0.29   0.774    -.1466907    .1094201
                       |
            z_baseline |    .689892   .0105226    65.56   0.000     .6691425    .7106414
                  age2 |  -.0701868   .0101687    -6.90   0.000    -.0902384   -.0501353
                female |   .1511745    .018643     8.11   0.000     .1144126    .1879365
            father_jhs |   .0029904   .0156957     0.19   0.849    -.0279598    .0339407
            mother_jhs |  -.0226791   .0155775    -1.46   0.147    -.0533962     .008038
                  ses1 |   .0109139   .0087198     1.25   0.212    -.0062807    .0281085
            class_size |    .003939   .0012168     3.24   0.001     .0015396    .0063384
              t_female |          0  (omitted)
                t_age2 |  -.0019025   .0093816    -0.20   0.840    -.0204021    .0165971
                 t_exp |  -.0025815   .0090856    -0.28   0.777    -.0204973    .0153344
             t_4yrcoll |  -.0004495   .0483592    -0.01   0.993    -.0958088    .0949099
                t_cert |  -.0344079   .0532285    -0.65   0.519     -.139369    .0705531
          t_major_math |  -.0064106   .0379894    -0.17   0.866    -.0813217    .0685004
          t_rank_yigao |   .1044285   .0495552     2.11   0.036     .0067108    .2021462
                       |
                blockZ |
                   18  |   .0760293   .0466505     1.63   0.105    -.0159607    .1680193
                   19  |   .0419535   .0608136     0.69   0.491    -.0779645    .1618715
                   27  |    .015885   .0669823     0.24   0.813    -.1161971    .1479671
                   28  |    .061135   .0529196     1.16   0.249     -.043217    .1654871
                   29  |   .1743579   .0608267     2.87   0.005      .054414    .2943019
                       |
                 _cons |    .627515   .2808764     2.23   0.027     .0736559    1.181374
----------------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_t_female.xls
dir : seeout
note: t_4yrcoll omitted because of collinearity

Linear regression                                      Number of obs =   14599
                                                       F( 23,   295) =  337.33
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5074
                                                       Root MSE      =  .69974

                                       (Std. Err. adjusted for 296 clusters in schid)
-------------------------------------------------------------------------------------
                    |               Robust
          z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
          treatment |
                 1  |    .097375   .0407071     2.39   0.017     .0172618    .1774881
                 2  |   .0547266   .0424698     1.29   0.199    -.0288556    .1383088
                    |
        1.t_4yrcoll |    .122192   .0521047     2.35   0.020     .0196479    .2247361
                    |
treatment#t_4yrcoll |
               1 1  |  -.3121934    .077761    -4.01   0.000      -.46523   -.1591567
               2 1  |   -.202614   .0743728    -2.72   0.007    -.3489825   -.0562454
                    |
         z_baseline |   .6885465   .0095221    72.31   0.000     .6698066    .7072864
               age2 |  -.0695504   .0085951    -8.09   0.000    -.0864659   -.0526348
             female |   .1409727   .0150871     9.34   0.000     .1112807    .1706647
         father_jhs |  -.0013405   .0126636    -0.11   0.916     -.026263    .0235819
         mother_jhs |  -.0009944   .0144005    -0.07   0.945    -.0293351    .0273462
               ses1 |   .0075962   .0075897     1.00   0.318    -.0073406     .022533
         class_size |   .0040652   .0009575     4.25   0.000     .0021809    .0059495
           t_female |   .0550319   .0306099     1.80   0.073    -.0052095    .1152732
             t_age2 |  -.0010589   .0075112    -0.14   0.888    -.0158413    .0137235
              t_exp |  -.0050072   .0070954    -0.71   0.481    -.0189712    .0089569
          t_4yrcoll |          0  (omitted)
             t_cert |   .0774736   .0503863     1.54   0.125    -.0216886    .1766357
       t_major_math |  -.0094625   .0313146    -0.30   0.763    -.0710909     .052166
       t_rank_yigao |   .1138518   .0399319     2.85   0.005     .0352644    .1924393
                    |
             blockZ |
                18  |   .0223269   .0422894     0.53   0.598    -.0609002    .1055541
                19  |   .0342039   .0547599     0.62   0.533    -.0735657    .1419735
                27  |   -.004117   .0487093    -0.08   0.933    -.0999788    .0917447
                28  |   .0092872   .0428992     0.22   0.829      -.07514    .0937144
                29  |   .0713419   .0503542     1.42   0.158    -.0277571    .1704408
                    |
              _cons |   .5005024   .2373115     2.11   0.036     .0334644    .9675404
-------------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore_t_4yrcoll.xls
dir : seeout
note: t_4yrcoll omitted because of collinearity

Linear regression                                      Number of obs =    9726
                                                       F( 26,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5167
                                                       Root MSE      =  .68658

                                           (Std. Err. adjusted for 196 clusters in schid)
-----------------------------------------------------------------------------------------
                        |               Robust
              z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
        1.in_person_sch |   .0411077   .0408632     1.01   0.316    -.0394828    .1216982
            1.t_4yrcoll |  -.1703173   .0805489    -2.11   0.036    -.3291761   -.0114585
                        |
in_person_sch#t_4yrcoll |
                   1 1  |  -.0354296   .0829788    -0.43   0.670    -.1990808    .1282216
                        |
             z_baseline |   .6916575    .012124    57.05   0.000     .6677465    .7155684
                   age2 |  -.0674467   .0101937    -6.62   0.000    -.0875507   -.0473426
                 female |   .1296586   .0176765     7.34   0.000     .0947969    .1645202
             father_jhs |  -.0158273   .0146375    -1.08   0.281    -.0446954    .0130408
             mother_jhs |   .0159026   .0174459     0.91   0.363    -.0185042    .0503095
                   ses1 |   .0058827   .0093129     0.63   0.528    -.0124843    .0242497
             class_size |   .0026907   .0010595     2.54   0.012     .0006012    .0047803
               t_female |   .0528183   .0361057     1.46   0.145    -.0183894     .124026
                 t_age2 |  -.0045353   .0089623    -0.51   0.613    -.0222109    .0131402
                  t_exp |  -.0081124   .0083609    -0.97   0.333    -.0246018     .008377
              t_4yrcoll |          0  (omitted)
                 t_cert |   .1911398   .0909853     2.10   0.037     .0116983    .3705813
           t_major_math |  -.0184199   .0356604    -0.52   0.606    -.0887495    .0519097
           t_rank_yigao |   .1513142   .0474897     3.19   0.002     .0576548    .2449737
                        |
                blockZZ |
                    12  |  -.0824553   .0733162    -1.12   0.262    -.2270498    .0621391
                    21  |  -.0376033   .0947009    -0.40   0.692    -.2243727    .1491662
                    22  |   .0234306   .0748033     0.31   0.754    -.1240967    .1709579
                    31  |   .0244011   .0977131     0.25   0.803     -.168309    .2171113
                    32  |    .026091    .116407     0.22   0.823    -.2034873    .2556693
                    41  |   .0007141   .0796947     0.01   0.993      -.15646    .1578883
                    42  |  -.0617735   .0777355    -0.79   0.428    -.2150838    .0915368
                    51  |  -.1205561   .0759594    -1.59   0.114    -.2703635    .0292514
                    52  |  -.0378172   .0850588    -0.44   0.657    -.2055705    .1299361
                    61  |   .0611147   .0842189     0.73   0.469    -.1049821    .2272116
                    62  |  -.0524192   .0772334    -0.68   0.498    -.2047391    .0999008
                        |
                  _cons |   .7169452   .2847738     2.52   0.013     .1553132    1.278577
-----------------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_t_4yrcoll.xls
dir : seeout
note: t_4yrcoll omitted because of collinearity

Linear regression                                      Number of obs =   10006
                                                       F( 20,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5098
                                                       Root MSE      =  .69753

                                           (Std. Err. adjusted for 201 clusters in schid)
-----------------------------------------------------------------------------------------
                        |               Robust
              z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
        1.in_person_sch |   .0874419   .0386521     2.26   0.025      .011224    .1636599
            1.t_4yrcoll |   .1219666   .0546198     2.23   0.027      .014262    .2296711
                        |
in_person_sch#t_4yrcoll |
                   1 1  |  -.2542853   .0710364    -3.58   0.000    -.3943617   -.1142089
                        |
             z_baseline |   .6880458   .0105598    65.16   0.000      .667223    .7088686
                   age2 |  -.0723051   .0102265    -7.07   0.000    -.0924708   -.0521395
                 female |   .1520028   .0186316     8.16   0.000     .1152632    .1887424
             father_jhs |   .0059926   .0156829     0.38   0.703    -.0249324    .0369177
             mother_jhs |  -.0189609   .0157586    -1.20   0.230    -.0500351    .0121134
                   ses1 |   .0095183   .0086166     1.10   0.271    -.0074727    .0265093
             class_size |   .0042725   .0011501     3.71   0.000     .0020046    .0065404
               t_female |   .0526789   .0358977     1.47   0.144    -.0181076    .1234655
                 t_age2 |   .0044511      .0093     0.48   0.633    -.0138874    .0227897
                  t_exp |  -.0087093   .0088684    -0.98   0.327    -.0261969    .0087783
              t_4yrcoll |          0  (omitted)
                 t_cert |   .0515103   .0576863     0.89   0.373     -.062241    .1652616
           t_major_math |  -.0122423   .0374126    -0.33   0.744    -.0860162    .0615315
           t_rank_yigao |   .1026585   .0478302     2.15   0.033     .0083423    .1969748
                        |
                 blockZ |
                    18  |   .0777893   .0424017     1.83   0.068    -.0058224     .161401
                    19  |   .0433467   .0579017     0.75   0.455    -.0708295    .1575229
                    27  |   .0180189    .062392     0.29   0.773    -.1050116    .1410494
                    28  |   .0472559   .0505492     0.93   0.351     -.052422    .1469337
                    29  |   .1573028   .0561954     2.80   0.006     .0464914    .2681142
                        |
                  _cons |   .3840865   .2890253     1.33   0.185    -.1858413    .9540144
-----------------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_t_4yrcoll.xls
dir : seeout
note: t_major_math omitted because of collinearity

Linear regression                                      Number of obs =   14599
                                                       F( 23,   295) =  317.68
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5055
                                                       Root MSE      =  .70105

                                          (Std. Err. adjusted for 296 clusters in schid)
----------------------------------------------------------------------------------------
                       |               Robust
             z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
             treatment |
                    1  |   .0494944   .0406149     1.22   0.224    -.0304373    .1294262
                    2  |  -.0236413    .042211    -0.56   0.576    -.1067141    .0594315
                       |
        1.t_major_math |   .0219124   .0515952     0.42   0.671    -.0796289    .1234537
                       |
treatment#t_major_math |
                  1 1  |  -.1430451   .0717014    -2.00   0.047    -.2841561   -.0019341
                  2 1  |   .0486504   .0702855     0.69   0.489    -.0896743     .186975
                       |
            z_baseline |   .6894771   .0095497    72.20   0.000     .6706829    .7082713
                  age2 |    -.06766   .0084046    -8.05   0.000    -.0842005   -.0511194
                female |    .140961   .0151677     9.29   0.000     .1111105    .1708115
            father_jhs |  -.0007724   .0125796    -0.06   0.951    -.0255295    .0239848
            mother_jhs |  -.0057601   .0143947    -0.40   0.689    -.0340895    .0225692
                  ses1 |   .0089044   .0077094     1.16   0.249     -.006268    .0240769
            class_size |    .003507   .0009502     3.69   0.000     .0016369    .0053771
              t_female |   .0575854   .0299411     1.92   0.055    -.0013398    .1165106
                t_age2 |  -.0040298   .0073551    -0.55   0.584    -.0185049    .0104452
                 t_exp |   -.001198   .0069783    -0.17   0.864    -.0149316    .0125355
             t_4yrcoll |  -.0282809   .0428341    -0.66   0.510    -.1125801    .0560182
                t_cert |  -.0045718   .0678726    -0.07   0.946    -.1381478    .1290041
          t_major_math |          0  (omitted)
          t_rank_yigao |   .1250296   .0410586     3.05   0.003     .0442248    .2058345
                       |
                blockZ |
                   18  |   .0122541   .0442262     0.28   0.782    -.0747847    .0992928
                   19  |   .0181386   .0563721     0.32   0.748    -.0928038    .1290809
                   27  |  -.0245573    .051494    -0.48   0.634    -.1258995    .0767849
                   28  |   .0221853   .0446053     0.50   0.619    -.0655995    .1099702
                   29  |   .0697493   .0522829     1.33   0.183    -.0331454    .1726439
                       |
                 _cons |    .672599   .2338404     2.88   0.004     .2123921    1.132806
----------------------------------------------------------------------------------------
3ie_guopei_control_stu_zscore_t_major_math.xls
dir : seeout
note: t_major_math omitted because of collinearity

Linear regression                                      Number of obs =    9726
                                                       F( 26,   195) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5166
                                                       Root MSE      =  .68662

                                              (Std. Err. adjusted for 196 clusters in schid)
--------------------------------------------------------------------------------------------
                           |               Robust
                 z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
           1.in_person_sch |   .0351121   .0432893     0.81   0.418    -.0502632    .1204874
            1.t_major_math |  -.0099779   .0621262    -0.16   0.873    -.1325034    .1125477
                           |
in_person_sch#t_major_math |
                      1 1  |  -.0144365   .0772001    -0.19   0.852    -.1666908    .1378177
                           |
                z_baseline |    .691598   .0121289    57.02   0.000     .6676773    .7155187
                      age2 |    -.06767   .0100952    -6.70   0.000    -.0875799   -.0477602
                    female |   .1294918   .0177619     7.29   0.000     .0944616    .1645219
                father_jhs |  -.0162283   .0145459    -1.12   0.266    -.0449157    .0124591
                mother_jhs |   .0160314   .0174544     0.92   0.360    -.0183922     .050455
                      ses1 |   .0061281   .0092514     0.66   0.509    -.0121176    .0243737
                class_size |   .0026813   .0010649     2.52   0.013      .000581    .0047816
                  t_female |   .0515602   .0361416     1.43   0.155    -.0197184    .1228388
                    t_age2 |   -.004192    .008823    -0.48   0.635    -.0215927    .0132088
                     t_exp |  -.0085009   .0081415    -1.04   0.298    -.0245576    .0075558
                 t_4yrcoll |  -.1916796   .0546651    -3.51   0.001    -.2994904   -.0838689
                    t_cert |   .1939151   .0943259     2.06   0.041     .0078852     .379945
              t_major_math |          0  (omitted)
              t_rank_yigao |     .15099   .0469225     3.22   0.002     .0584492    .2435307
                           |
                   blockZZ |
                       12  |  -.0787279   .0735152    -1.07   0.286    -.2237148     .066259
                       21  |  -.0325972   .0955734    -0.34   0.733    -.2210875     .155893
                       22  |   .0287823   .0761515     0.38   0.706     -.121404    .1789686
                       31  |   .0329754   .0962798     0.34   0.732     -.156908    .2228587
                       32  |   .0273077   .1160707     0.24   0.814    -.2016073    .2562228
                       41  |   .0033278   .0800669     0.04   0.967    -.1545805    .1612361
                       42  |  -.0576524   .0784306    -0.74   0.463    -.2123336    .0970288
                       51  |  -.1124384   .0748732    -1.50   0.135    -.2601037    .0352269
                       52  |  -.0348498   .0866297    -0.40   0.688    -.2057012    .1360017
                       61  |   .0668506   .0858445     0.78   0.437    -.1024523    .2361535
                       62  |  -.0452261   .0767873    -0.59   0.557    -.1966664    .1062142
                           |
                     _cons |   .7118625   .2796538     2.55   0.012     .1603281    1.263397
--------------------------------------------------------------------------------------------
3ie_inpersonYN_stu_zscore_t_major_math.xls
dir : seeout
note: t_major_math omitted because of collinearity

Linear regression                                      Number of obs =   10006
                                                       F( 20,   200) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.5067
                                                       Root MSE      =   .6997

                                              (Std. Err. adjusted for 201 clusters in schid)
--------------------------------------------------------------------------------------------
                           |               Robust
                 z_endline |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
           1.in_person_sch |   .0322258   .0406985     0.79   0.429    -.0480274    .1124789
            1.t_major_math |   .0201679   .0508816     0.40   0.692    -.0801652     .120501
                           |
in_person_sch#t_major_math |
                      1 1  |  -.0517303   .0638291    -0.81   0.419    -.1775947     .074134
                           |
                z_baseline |   .6887885   .0106272    64.81   0.000     .6678329    .7097442
                      age2 |   -.070545    .010072    -7.00   0.000    -.0904058   -.0506841
                    female |   .1509522    .018636     8.10   0.000      .114204    .1877004
                father_jhs |   .0031816   .0156209     0.20   0.839    -.0276211    .0339843
                mother_jhs |  -.0225419   .0155519    -1.45   0.149    -.0532086    .0081248
                      ses1 |   .0115228   .0086649     1.33   0.185    -.0055635    .0286091
                class_size |   .0038695   .0011956     3.24   0.001      .001512     .006227
                  t_female |   .0524075   .0370639     1.41   0.159    -.0206787    .1254938
                    t_age2 |  -.0014292   .0092775    -0.15   0.878    -.0197234    .0168651
                     t_exp |  -.0030912   .0088851    -0.35   0.728    -.0206117    .0144294
                 t_4yrcoll |  -.0017718   .0475216    -0.04   0.970    -.0954796    .0919359
                    t_cert |  -.0488067   .0529949    -0.92   0.358    -.1533073    .0556938
              t_major_math |          0  (omitted)
              t_rank_yigao |   .1055434    .049003     2.15   0.032     .0089145    .2021723
                           |
                    blockZ |
                       18  |   .0787222   .0470008     1.67   0.096    -.0139585     .171403
                       19  |   .0433814   .0602736     0.72   0.473    -.0754719    .1622347
                       27  |   .0116186   .0663269     0.18   0.861    -.1191713    .1424084
                       28  |   .0632496   .0533118     1.19   0.237    -.0418758     .168375
                       29  |   .1722294   .0604185     2.85   0.005     .0530903    .2913684
                           |
                     _cons |    .635724   .2806314     2.27   0.025      .082348      1.1891
--------------------------------------------------------------------------------------------
3ie_inpersonY_control_stu_zscore_t_major_math.xls
dir : seeout

. 
. 
.         generate het1 = t_female
(403 missing values generated)

.         generate treatment_sch1_het1 = treatment_sch1*t_female
(403 missing values generated)

.         generate treatment_sch2_het1 = treatment_sch2*t_female
(403 missing values generated)

.         
.         generate het2 = t_4yrcoll
(403 missing values generated)

.         generate treatment_sch1_het2 = treatment_sch1*t_4yrcoll
(403 missing values generated)

.         generate treatment_sch2_het2 = treatment_sch2*t_4yrcoll
(403 missing values generated)

.         
.         generate het3 = t_major_math
(403 missing values generated)

.         generate treatment_sch1_het3 = treatment_sch1*t_major_math
(403 missing values generated)

.         generate treatment_sch2_het3 = treatment_sch2*t_major_math
(403 missing values generated)

. 
.         generate het4 = 1 - t_female
(403 missing values generated)

.         generate treatment_sch1_het4 = treatment_sch1*het4
(403 missing values generated)

.         generate treatment_sch2_het4 = treatment_sch2*het4
(403 missing values generated)

.         
.         generate het5 = 1 - t_4yrcoll
(403 missing values generated)

.         generate treatment_sch1_het5 = treatment_sch1*het5
(403 missing values generated)

.         generate treatment_sch2_het5 = treatment_sch2*het5
(403 missing values generated)

.         
.         generate het6 = 1 - t_major_math
(403 missing values generated)

.         generate treatment_sch1_het6 = treatment_sch1*het6
(403 missing values generated)

.         generate treatment_sch2_het6 = treatment_sch2*het6
(403 missing values generated)

.         
.         generate in_person_sch_het1 = in_person_sch*t_female
(403 missing values generated)

.         generate in_person_sch_het2 = in_person_sch*t_4yrcoll
(403 missing values generated)

.         generate in_person_sch_het3 = in_person_sch*t_major_math
(403 missing values generated)

.         generate in_person_sch_het4 = in_person_sch*het4
(403 missing values generated)

.         generate in_person_sch_het5 = in_person_sch*het5
(403 missing values generated)

.         generate in_person_sch_het6 = in_person_sch*het6
(403 missing values generated)

.         
. /*

end of do-file

. regress dropout i.group1 i.group2 i.group3, vce(cluster schid)
variable dropout not found
r(111);

. 
. mat coefs1 = e(b)

. 
. mat ses1 = e(se)

. 
. 
. 
. regress math_selfconcept i.group1 i.group2 i.group3, vce(cluster schid)
variable math_selfconcept not found
r(111);

. 
. mat coefs2 = e(b)

. 
. mat ses2 = e(se)

. 
. 
. 
. 
. 
. 
. 
. 
. 
. regress dropout i.group4 i.group1, vce(cluster schid)
variable dropout not found
r(111);

. 
. mat coefs3 = e(b)

. 
. mat ses3 = e(se)

. 
. 
. 
. 
. 
. 
. 
. 
. 
. regress dropout i.group4 i.group3, vce(cluster schid)
variable dropout not found
r(111);

. 
. mat coefs4 = e(b)

. 
. mat ses4 = e(se)

. 
. 
. 
. 
. 
. matrix results = coefs1, ses1 \ coefs2, ses2 \ coefs3, ses3 \ coefs4, ses4

. 
. matrix list results

results[4,30]
               0b.             1.            0b.             1.  0b.in_pers~h#  0b.in_pers~h#  1o.in_pers~h#  1.in_perso~h#                              
     in_person_~h   in_person_~h   t_major_math   t_major_math   0b.t_major~h   1o.t_major~h   0b.t_major~h   1.t_major_~h     z_baseline           age2
y1              0      .03222575              0       .0201679              0              0              0     -.05173033      .68878852     -.07054498
y1              0      .03222575              0       .0201679              0              0              0     -.05173033      .68878852     -.07054498
y1              0      .03222575              0       .0201679              0              0              0     -.05173033      .68878852     -.07054498
y1              0      .03222575              0       .0201679              0              0              0     -.05173033      .68878852     -.07054498

                                                                                                                                                         
           female     father_jhs     mother_jhs           ses1     class_size       t_female         t_age2          t_exp      t_4yrcoll         t_cert
y1      .15095219       .0031816     -.02254191      .01152278      .00386953      .05240751     -.00142916     -.00309116     -.00177182     -.04880674
y1      .15095219       .0031816     -.02254191      .01152278      .00386953      .05240751     -.00142916     -.00309116     -.00177182     -.04880674
y1      .15095219       .0031816     -.02254191      .01152278      .00386953      .05240751     -.00142916     -.00309116     -.00177182     -.04880674
y1      .15095219       .0031816     -.02254191      .01152278      .00386953      .05240751     -.00142916     -.00309116     -.00177182     -.04880674

                o.                           1b.             2.             3.             4.             5.             6.                              
     t_major_math   t_rank_yigao         blockZ         blockZ         blockZ         blockZ         blockZ         blockZ          _cons             c1
y1              0      .10554341              0      .07872223      .04338139      .01161857       .0632496      .17222936      .63572402              .
y1              0      .10554341              0      .07872223      .04338139      .01161857       .0632496      .17222936      .63572402              .
y1              0      .10554341              0      .07872223      .04338139      .01161857       .0632496      .17222936      .63572402              .
y1              0      .10554341              0      .07872223      .04338139      .01161857       .0632496      .17222936      .63572402              .

. 
. 
. 
. 
. 
. matrix rownames results = "Panel A: Dropout" "Math selfconcept" "Math anxiety" "Intrinsic motivation" "Instrumental motivation" "Time on math"
conformability error
r(503);

. 
. matrix colnames results = "(1) PD" "(2) PD + Follow-up" "(3) Difference" "(4) P-value" "(5) Observations"

. 
. matrix export "TABLE3_results.csv", replace
matrix operation not found
r(501);

. do "C:\Users\RESEAR~1\AppData\Local\Temp\STD02000000.tmp"

. clear

. 
. * Generating interaction terms for heterogeneous effects
. generate het1 = t_female
t_female not found
r(111);

end of do-file

r(111);

. exit, clear
